[
    {
        "id": "50146f21-d265-4e3a-8d93-8165cdbe89a3",
        "syllogism": "All cars are a type of vehicle. No animal is a car. Therefore, no animal can be a vehicle.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "dfafb4f6-4e1d-4cd5-aeb4-75d36aafdf1a",
        "syllogism": "Nothing that is a soda is a juice. A portion of the things that are beverages are juices. The only logical conclusion is that some beverages are not sodas.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e30b1f83-a4c3-49cb-8aaf-5f64208c625b",
        "syllogism": "Everything that is a planet is a celestial body. Anything that is a sun is a celestial body. There exists at least one sun that is a planet.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "a30e07d5-0fb3-4097-9892-4b145b0c54f5",
        "syllogism": "Every cat is an invisible creature. A number of cats are animals. Consequently, a portion of animals are invisible.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5b8161b7-b1bf-4e16-a854-cd52cdce8a1b",
        "syllogism": "There are no capital cities which are oceans. A select few large cities are classified as capital cities. Therefore, it is clear that some large cities are not oceans.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "bec15083-5e98-4b5b-87ff-39ccbd7c708c",
        "syllogism": "Every city is a location. Anything that is a location is a capital city. Therefore, every capital city is a city.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "57178844-d267-4d84-90ea-d2a29f973cda",
        "syllogism": "No star is a meteor. Meteors are, without exception, planets. A number of planets are stars.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "974fa1fe-accf-472a-80fc-1d65f12ffdd6",
        "syllogism": "Every single cat is an animal. Anything that can be called a dog is, without exception, an animal. Every dog is a cat.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "2ace5ae0-70b9-43bd-a8c2-24664230d730",
        "syllogism": "There are no mammals that are animals. Everything that is an elephant is a mammal. Thus, every elephant is an animal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "07c1b3ad-3718-4db7-9047-6265e2a89541",
        "syllogism": "Anything that is a bird is an animal. Every single creature that is a sparrow is an animal. Consequently, all sparrows are birds.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "4fd3411a-3f94-4ebb-91e8-9e50c856af27",
        "syllogism": "There exist students that are adults. Every single person who is a student is a person. It follows that not a single person is an adult.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "fa03648a-a269-4249-b481-7a12cd672f0b",
        "syllogism": "Plants are in no way living organisms. All things that are trees are living organisms. Trees cannot be classified as plants.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3b92be82-c8c1-4be8-92eb-a6301d39617b",
        "syllogism": "Every single car is a vehicle. Everything that is a bicycle is a vehicle. It is the case that some bicycles are not cars.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "aff588cb-12e4-423f-b36c-0b7f10ba8bda",
        "syllogism": "Every single animal that is a spider is a creature with eight legs. A few of the things known as daddy longlegs are creatures with eight legs. As a result, not all daddy longlegs are spiders.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "2cd1f13b-eb67-42b7-a345-da72e5fb4d80",
        "syllogism": "Some mammals are dogs. There are some cats who are mammals. Cats are in no way dogs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fc477a4d-acad-4c3b-a989-ef97e9454f41",
        "syllogism": "Every insect is an animal. All mammals are animals. Consequently, every single mammal is an insect.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "83ac1ca9-a215-43a1-98b6-0c65af285baf",
        "syllogism": "Every single gecko is a type of lizard. A number of geckos are also reptiles. Therefore, some reptiles are lizards.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "321e05bd-2e8f-412d-beff-9ec29ac7ed43",
        "syllogism": "It is not the case that every human is a male. Every single human is a creature with ten legs. From this, it follows that some creatures with ten legs are males.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "14cb2005-b721-40ef-8182-d28a07014f8d",
        "syllogism": "It is true that no building is a vehicle. Each house, without exception, is a building. Therefore, no houses can be vehicles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "3ffa69d7-8ae1-49e3-97ce-102a0df6db2e",
        "syllogism": "Anything that is an elephant is also a four-legged animal. A portion of insects are creatures that have four legs. Therefore, some insects are not elephants.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f9e0aef5-2abd-4515-8daf-6a4bf83c42ed",
        "syllogism": "There are no books that are made of paper. There is not a single paperback that is a book. It follows, then, that some paperbacks are not made of paper.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "88d37702-8d01-42e5-93a9-66394796e42a",
        "syllogism": "No giant balls of gas are stars. Suns are, without exception, giant balls of gas. No star can be considered a sun.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "c6a92b4e-ca9a-475c-9fec-967fbec7ab36",
        "syllogism": "It is true that no fish live in the sea. There are fish, and some of them are salmons. Based on this, it must be the case that a certain amount of salmons do not live in the sea.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "1825a5b1-ce1d-4b0c-a925-c4e37c0c7a8a",
        "syllogism": "It is not true that any tree is green. There is not a single car that is a tree. Consequently, there is no car that is green.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "120750b7-c851-4669-8ec1-d76af5def5de",
        "syllogism": "There are no rocks that are objects. A few tables are, surprisingly, rocks. This means that a portion of tables are not objects.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "013bbe5b-4863-4f9f-a0e7-fcec256129b3",
        "syllogism": "There are some planets that are dogs. All things that are dogs are beings. Hence, it can be concluded that some beings are planets.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5e8aeb75-acdb-49d0-bd8c-f0285f65144a",
        "syllogism": "Some fish are penguins. All penguins belong to the class of birds. One must conclude that some birds are fish.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "6b02110b-77c6-4547-a4ad-f874027d9bba",
        "syllogism": "It is true that all newspapers are animals. There are some magazines that are not animals. Therefore, it is the case that some magazines are not newspapers.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b9e979ff-4eb8-45be-8b2f-ef1e41279c7d",
        "syllogism": "Any person who is a doctor is a cloud. Every single doctor is a person with a degree. This proves that every person with a degree is a cloud.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "96c9e18a-0d96-46ed-8234-5d369c2ba459",
        "syllogism": "It is true that no fish is a swimmer. There are fish, and some of them are tuna. Based on this, it must be the case that a certain amount of tuna are not swimmers.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "c890f2c1-9631-4153-a60e-02a9a89ad258",
        "syllogism": "Every single creature that is an animal with fins is a fish. It is also the case that some whales are fish. This leads to the conclusion that some whales are animals with fins.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ce1e081e-8930-4195-a306-447d9f30f18c",
        "syllogism": "There are some animals that are mammals. Something that is a dog is an animal. Consequently, every dog is a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "244cf8ba-d6bd-4acb-83db-841c05330954",
        "syllogism": "Anything that is a feline is a mammal. There are no cats that are felines. Thus, there are no cats that are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d1335273-381d-48fd-b681-e32114f7cf90",
        "syllogism": "Every single triangle is a polygon. It is not the case that some lines are polygons. Therefore, it follows that some lines are not triangles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a6cae303-c3b4-47e8-9d24-684efce69c15",
        "syllogism": "Every single person who is an animal is a living thing. Not a single building is an animal. The conclusion that no buildings are living things is inescapable.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "36fdea7c-f8c5-4b3e-9989-7ef62a3e4cec",
        "syllogism": "There are no dogs that are cats. Everything that is a bird is a dog. Thus, every bird is a cat.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "fafcc44f-e5ec-4fe9-8bed-96eb1ad1ab3d",
        "syllogism": "Any object that is a building is also a structure. There is not a single structure that is a cloud. It follows that no cloud is a building.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "ba26d7cc-4c9a-40f2-817d-73b6f91781ab",
        "syllogism": "Some clouds are houses. A house is a building. As such, it is necessarily true that some buildings are clouds.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "9bf9af39-9b60-43da-a871-23190a6d5e52",
        "syllogism": "Not a single creature that is a retriever is a dog. Every single animal is a retriever. It must be the case that no animal is a dog.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "4d7aa5d5-4fdc-49d1-b879-1d6fca829c8e",
        "syllogism": "Every single square is a polygon. There are no polygons which are circles. Thus, it can be concluded that some circles are not squares.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "3cd77d99-1835-4e01-bc28-735872543a65",
        "syllogism": "Some things that are potatoes are not living things. Every single thing that is a potato is a human. A logical consequence of this is that some humans are not living things.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "1f6dfbc9-0387-40b0-88fa-e3205947edf3",
        "syllogism": "It is true that all fish live in water. No birds are fish. Therefore, no bird lives in water.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c2029414-d28e-4fbd-acc8-12f855acf46c",
        "syllogism": "Every fictional characters is a stone. There are fictional characters which are animals. Thus, a portion of animals are stones.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "6633c065-240e-49e5-95cc-efde4ee297e9",
        "syllogism": "An insect is never an arachnid. There are spiders that are arachnids. The only conclusion to draw is that some spiders are not insects.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "634576cd-c53e-4b24-902a-97f9f6017d81",
        "syllogism": "It is not true that any dog is an animal. Nothing that is a mammal is a dog. This leads to the conclusion that no mammal is an animal.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "64499fcd-3761-46d4-8fd9-3c15d4cf5405",
        "syllogism": "There are no tables that are living things. It is not true that any plant is a table. It is the case that some plants are tables.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "67f51404-e5be-4394-ae67-b7fef1dddf8b",
        "syllogism": "Written works are in no way items with printed pages. Everything that is a book is an item with printed pages. Books are not written works.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "4d476b7d-8af6-4690-8a19-2dc753c37d8a",
        "syllogism": "Anything that is a plant with thorns is not a flower. A certain number of roses are considered plants with thorns. This demonstrates that some roses are not flowers.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "fb44e9f7-2a9f-42d5-b533-699306c4ea55",
        "syllogism": "Any celestial body which is a planet is a cube. A portion of celestial bodies are planets. Consequently, some celestial bodies are cubes.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "7984c936-c1c3-4738-9457-30cdb2154ab1",
        "syllogism": "Every square is a shape that is also a rectangle. Every rectangle is a polygon. It follows that some polygons are squares.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "f2b6985a-8b9d-47a2-8707-5e50b8348639",
        "syllogism": "There is not a single tree that is a shrub. It is known that some oaks are trees. Consequently, some oaks are not shrubs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "dd82fade-0432-4f9c-a72a-d2e6ba056b77",
        "syllogism": "Any person who is a human is a robot. The set of people contains no robots. It is the case that some people are not humans.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "c4cd23fd-f1d6-4bca-af94-e443e063a809",
        "syllogism": "Anything that is an apple is not a citrus fruit. The group of items known as fruits has some members that are citrus fruits. The result of this is that some fruits are not apples.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "331bc8f9-e5c1-40f3-ace4-77fbe5ad4719",
        "syllogism": "Lions are not gazelles. All African lions are things that are lions. It follows that there are some African lions that are not gazelles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "8e758feb-cf87-4301-893d-6d70aaa8976e",
        "syllogism": "Every single idea is a tree. Every single idea is an animal. Therefore, there are animals that are trees.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "72fa74c7-77a1-492e-b3ca-50f86c8c0ae4",
        "syllogism": "Anything that is cutlery is furniture. There are no pieces of cutlery which are also spoons. It is the case that some cutlery is not a spoon.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "75ec1d48-d566-4b82-a934-4ca52bfb7ed4",
        "syllogism": "Every single mammal is an animal. There are no fish which are mammals. Consequently, there are no fish which are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8cd07a48-a1a5-408d-97ab-6827a4176f99",
        "syllogism": "Nothing that is a canine is a cat. A certain number of dogs are canines. Thus, some dogs are cats.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "166ef094-68ea-4c29-88fb-a7ae68694ba2",
        "syllogism": "Some animal that is a reptile is not an amphibian. It is known that a portion of crocodiles are reptiles. From this, we can deduce that some crocodiles are not amphibians.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "073ed5ec-8986-46df-8f40-c331dd8de902",
        "syllogism": "Every single hammer is a tool. There are no nails that are hammers. It follows from this that every nail is a tool.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "47a4ad18-32f0-4dfd-a80a-e74b7a6c5e0b",
        "syllogism": "No single plant is a tree. A select few pines are classified as plants. It is therefore a fact that some pines are not trees.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "9c06e896-d5b8-47ed-875e-43c6fc526c44",
        "syllogism": "Anything that is a animal is an idea. There are no ideas that are dogs. This necessarily suggests that some dogs are not animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a6e185ca-a3ef-4331-a018-88d696548ce8",
        "syllogism": "Anything that is a bicycle is a vehicle. It is known that no trucks are bicycles. This leads to the conclusion that no truck is a vehicle.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f55fb37b-2c59-40d7-9d2c-0542f4b4d1d2",
        "syllogism": "Anything that is a star is a spoon. There exist no spoons that are suns. From this, we can deduce that some suns are not stars.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "1b777e34-ed5d-4ffe-9de6-43a33229f1ab",
        "syllogism": "Anything that is a fruit is a feeling. There are no feelings which are apples. As a result, we can conclude that some apples are not fruits.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "35c45723-f9be-40f0-b525-0dd530196630",
        "syllogism": "Every single animal is a living thing. Everything that is a human is also a living thing. Consequently, every human is an animal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "0845a009-1b8b-4727-9c20-7f46b8416612",
        "syllogism": "There are some creatures that are animals and not vertebrates. All cats are also vertebrates. This leads to the conclusion that there are some cats which are animals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "90b5d022-b2d7-4fbe-9386-f956381db9af",
        "syllogism": "Any fire is frozen. There are some flames that are fire. Therefore, it is implied that some flames are frozen.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0820d34a-6e2d-4f52-a975-d6f640f2ffe7",
        "syllogism": "It is completely false that any creature which is a bird is a fish. There exists a group of birds who are also penguins. A valid inference is that some penguins are fish.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f6b3b0ad-76d8-4628-94d1-1a7aedb82cb5",
        "syllogism": "There are no triangles which are squares. Every single triangle is a polygon. It's the case that some polygons are not squares.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c6c8dd70-9d83-4a8b-9f51-e1d5225aaaf9",
        "syllogism": "There are no clouds that are rocks. There are no rocks that are mountains. Therefore, some mountains are clouds.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "4a21a53f-3e8b-46ca-b904-9e8eaf8a638f",
        "syllogism": "Anything that is a mammal is an animal. Every single dog is an animal. This means that all dogs are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "54c5b3f8-ba16-4eaf-86a1-71d78b771192",
        "syllogism": "All things which are numbers are animals. All things which are numbers are plants. It follows that some plants are animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "299b601b-795b-47fa-8fae-2bee0a555b0e",
        "syllogism": "No books are buildings. Some things made of paper are books. From this, it is concluded that some buildings are made of paper.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "0d6a4be3-97f2-4681-ab04-5a342bedfe4e",
        "syllogism": "The set of automobiles and the set of self-propelled vehicles are entirely separate. The entire category of cars is composed of self-propelled vehicles. Automobiles are not cars.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "eda05d11-5c82-4cc0-a078-4896b726afc8",
        "syllogism": "There are no lions which are herbivores. Every single lion is a predator. Therefore, we can conclude that some predators are not herbivores.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c1a76792-1837-4828-87cd-86b5870e8706",
        "syllogism": "There are no parrots which are mammals. Some birds are parrots. This implies that every bird is a mammal.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "077078f3-93b5-4e7d-8376-66acd052c2c0",
        "syllogism": "Every doctor is a professional. The set of children does not contain professionals. At least one child is not a doctor.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9c38a362-17ab-4f2e-a883-d6bd3ff7fa2e",
        "syllogism": "Every tiger is a feline. All tigers are also mammals. Therefore, all mammals are felines.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6c246ba6-8a91-453a-a027-c41877ac446c",
        "syllogism": "It is not the case that every single scientist is an engineer. Every scientist is an elevator. It follows from this that some elevators are engineers.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "47f1b584-9689-4744-a190-7112a13c9cb2",
        "syllogism": "There are some reptile that are animals. Every single snake is a reptile. It is therefore the case that all snakes are animals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f093ca09-2dbe-4258-a4f4-28823d3eaefb",
        "syllogism": "Anything that is a bird is an animal. Everything that is a zebra is an animal. All birds are zebras.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "88f1d8e5-30a4-47e4-abda-cd1f50fa77e0",
        "syllogism": "Anything and everything that is a satellite is a moon. There are satellites that are planets. It must follow that all planets are moons.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "1f4cfe1c-bd8f-4c54-8c08-a8ee3ad42904",
        "syllogism": "There are no animals that are fish that have beaks. All birds are animals that have beaks. Consequently, it can be said that some birds are not fish.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9c6100d8-e495-4a1e-b797-a45b2e68b4d0",
        "syllogism": "There are some scientists who are engineers. It is a known fact that some scientists are also doctors. From this, it is suggested that some doctors are engineers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "0752c43f-402a-4032-8b0b-d30a4ef6c669",
        "syllogism": "A certain number of cars are vehicles. All vehicles are considered modes of transportation. It logically follows that some modes of transportation are cars.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "af093ce5-5c2e-4190-8421-5cbf7e6fef3d",
        "syllogism": "Any fruit is a food. It is the case that no apple is a food. This means that no apple is a fruit.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ea73e9d5-ebb1-403c-9ea4-f7458c313107",
        "syllogism": "Not a single person who is a doctor is also an engineer. Among the group of people who are doctors, some are researchers. From this, we can logically conclude that there are some researchers who are not engineers.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9f087d4f-5b6f-4d89-b9a0-2ed39ea55950",
        "syllogism": "It is the case that no circles are round shapes. All of the things that are rings are circles. Thus, some rings are not round shapes.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a5b70f2f-0463-40e2-a48a-1806106578ad",
        "syllogism": "It is true that no cats are dogs. There are some people who are not dogs. It follows that some people are not cats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ee91ca83-4f5e-48ac-ae52-93ad7842c9fb",
        "syllogism": "All houses are structures. There are no bridges that are houses. Therefore, no bridge is a structure.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "3b4c6ca3-db28-4693-b2aa-577606295336",
        "syllogism": "Anything that is a person is made of wood. Without exception, all children are people. Therefore, there are no children who are not made of wood.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "535b8c6e-ffc6-43f1-8660-73b8877862cd",
        "syllogism": "Every single dog is a mammal. There are no dogs that are fish. Therefore, there are no fish that are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "45599b2f-5e2e-4fe6-ab81-0a05a9ab3eef",
        "syllogism": "Things that are thoughts are not electrical signals in the brain. Every single idea is a thought. Therefore, some ideas are not electrical signals in the brain.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "d391cce1-9ad3-4ef0-8549-6f19e2d96d90",
        "syllogism": "It is the case that every single book weighs a ton. A portion of novels are books. Consequently, some novels weigh a ton.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "e57dd7c0-a696-481c-90f9-2529ca71feb7",
        "syllogism": "There are no hard workers who are also lazy people. Some students are hard workers. It is concluded that some students are lazy people.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "a21c713d-5074-418b-abd7-c49abb0de57c",
        "syllogism": "Not a single land-dwelling amphibian is able to survive in saltwater. Every salamander is, without exception, a land-dwelling amphibian. This implies that no salamander is able to live in saltwater.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "4c5effb9-426b-4d87-b8bb-a92cccef1b85",
        "syllogism": "Every single fruit is a thing that grows on trees. All apples are things that grow on trees. At least one apple is a fruit.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f243d632-c0c2-487b-8e12-1c35bdc7c321",
        "syllogism": "Every airplane is a cloud. It is true that every bird is a cloud. This means that every single bird is an airplane.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f96c05f3-3cc5-465b-a17d-3b7d30e5607e",
        "syllogism": "Every single building is made of candy. There are no houses that are not buildings. A certain number of houses are made of candy.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "4b4d8668-e0ae-4785-bcc5-bdd2eaa02eeb",
        "syllogism": "There are no vegetables that are fruits. It is also true that no minerals are vegetables. From this, it is suggested that some minerals are fruits.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d1c92c02-bd97-4456-a14d-9b82b65cd5b1",
        "syllogism": "Anything that is a vehicle is also a machine. There is a subset of machines that are cars. Therefore, some cars are not vehicles.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "778ba99e-1bed-4d97-b358-1ee48a6c9429",
        "syllogism": "There are no universities which are plants. At least one tree is a plant. At least one tree is a university.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b15f5ad1-2553-4a6f-95bd-07e4329ac851",
        "syllogism": "It is true that some students are athletes. There are some tall people which are athletes. It logically follows that some tall people are not students.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "1e1519e3-f441-4496-9305-1c5a6a4e67e6",
        "syllogism": "Nothing that can be considered a celestial body is an object that orbits a star. Every planet is an object that orbits a star. There exist no planets that are also celestial bodies.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "7bd2fd32-89de-4452-9e86-6a8dc57ef575",
        "syllogism": "Every object that is a table is a type of furniture. There exist no pieces of furniture that are cars. From this, we must conclude that some cars are not tables.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "712feadb-84db-4b6d-9ef4-3a4d670f0d66",
        "syllogism": "It is the case that no ghost is immortal. There is not a single human that is a ghost. It follows that no human is immortal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "93bed46d-aedf-4815-89b1-472bcdc8be3e",
        "syllogism": "Anything that is a bird is not an animal. Of the items that are sparrows, some are animals. It must be the case that some sparrows are not birds.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "84b624a9-4de1-40a4-a584-7d961b6d017c",
        "syllogism": "Reptiles are a class of animal which does not contain any amphibians. All things that are frogs are amphibians. The group of frogs and the group of reptiles have no members in common.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e465903e-2d8d-4f52-b3f6-b3751715ab50",
        "syllogism": "There are no objects that are both tools and have handles. The entire set of objects with handles is composed of hammers. A portion of tools are hammers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "90896290-4510-43fe-98a6-4a75e7d31150",
        "syllogism": "The group of continents and the group of countries are mutually exclusive. Canada is not a continent. Therefore, Canada is a country.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fbff2acc-3c75-4e1e-9ee6-57534e7b958b",
        "syllogism": "Not a single human is a tree. The entire set of trees is composed of women. It logically follows that some women are not human.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3f5f67b4-3d96-44d3-b94e-e4422a21ac05",
        "syllogism": "There is no mammal that is a shark. Some of the sharks are fish. Therefore, some fish are not mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "53ebb02d-437a-481d-a71f-b83ef47b5b61",
        "syllogism": "There are some band members who are singers. All band members are considered musicians. It follows that some musicians are singers.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "7e33d84f-4a3e-4ec4-a5ad-df409ed4bbd7",
        "syllogism": "Every single bird is an animal. There are no animals that are minerals. This proves that some minerals are not birds.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "12233461-2fe7-4df7-accf-0abbbe78552f",
        "syllogism": "Among the people who are scientists, there are some who are also programmers. Of the people who are musicians, a number of them are programmers. It therefore stands that some people who are musicians are also scientists.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f80d23ac-7850-4f7e-8d85-bcdcaf460d28",
        "syllogism": "Every bird is a fish. There are no fish which are sparrows. This necessarily suggests that some sparrows are not birds.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "df24dcd9-6c90-418a-aef9-4f321e1d8386",
        "syllogism": "There are no shirts which are vegetables. Some clothing is shirts. This implies that every piece of clothing is a vegetable.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "5a1f112a-255f-4a5d-9388-e9cf667f6536",
        "syllogism": "Every single house is a building. A few schools are classified as buildings. As a result, not all schools are houses.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "7258b953-a6a7-46f3-8c1b-04322353da9f",
        "syllogism": "The set of humans is a subset of the set of mortals. At least one robot is not a mortal. There is at least one robot who is not a human.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ab1b1f7c-4328-4345-b449-99e1b7e58b05",
        "syllogism": "Every star is a luminous celestial body. There are some planets that are not luminous. It is the case that some planets are not stars.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "2a533cd3-5dab-425d-9dca-9f2d6cfcb4c7",
        "syllogism": "Chairs are in no way furniture. Everything that is a chair is an object. There are some objects that are not furniture.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b626e3e8-f26b-4503-b6b8-a52f059f3906",
        "syllogism": "Some item that is an animal is not a mammal. Some dogs are mammals. Therefore, all dogs can be said to be animals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "62b1e53b-5c4e-4af8-b02a-809222c5ecf0",
        "syllogism": "All of the things that are lions are felines. All of the things that are cats are felines. It can be deduced that there are cats that are lions.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "7eb64f6f-5665-43a6-bb00-a3dccba8a3d9",
        "syllogism": "It is impossible for a spider to be a bird. A portion of spiders are considered arachnids. It is necessarily the case that some arachnids are not birds.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "dc619e1d-03de-41c4-9639-d01e174c5284",
        "syllogism": "Each bird is a vertebrate. Each bird is an animal that has wings. So, some animals with wings must be vertebrates.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "f5d61309-4d28-4e37-a062-8bc81f17ff93",
        "syllogism": "There are some capitals that are polluted. All capitals are, by definition, cities. One must conclude that some cities are polluted.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "4e129e3f-4ae0-41ba-9321-a04e949f6eb6",
        "syllogism": "There are some tables that are happiness. Anything that is happiness is an emotion. Consequently, some emotions are tables.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "37244c2f-0d09-431f-9e20-29f78f14aab7",
        "syllogism": "Anything that is a puppy is venomous. A few puppies are kept as pets. This implies that a certain number of pets are venomous.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b2e875c8-2a19-4aab-a7d0-b5116bde9dc6",
        "syllogism": "There are some creatures that are mammals and also animals. Among the group of creatures that are tigers, some are animals. It follows that at least some tigers are not mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c88bec75-1d67-4660-8898-d3f8d060d626",
        "syllogism": "No vegetable is a type of meat. It is true that every single meat is a food. This proves that some vegetables are food.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "31dad269-5af0-4f1d-9a02-947fd1150eeb",
        "syllogism": "It is a fact that all mammals are animate objects. There are some animals which are zebras. Therefore, every single zebra is an animate object.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "095c8569-a07c-42c1-9859-b99e50f8a168",
        "syllogism": "It is the case that no insect is a mammal. Every single insect is an animal. For this reason, every animal is a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "aa1592a2-ee31-4516-a215-5435d25844df",
        "syllogism": "Every object that is a car has an engine. Some motorized vehicles are cars. Therefore, all motorized vehicles have engines.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "c57395fe-25dd-4f44-acfa-71ecd87ed2b4",
        "syllogism": "It is true that anything that is an apple is an edible thing. Every apple is a fruit. It follows that some fruits are edible things.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "6c22b36f-ad54-4762-8fc6-7f9136e770b5",
        "syllogism": "There exist some things which are rivers, that are not oceans. Anything that is a river is a body of water. A logical consequence of this is that some bodies of water are not oceans.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "d395b65f-fa01-475b-a5f9-1043660ab986",
        "syllogism": "Every bird is an animal. All humans are animals as well. Therefore, all humans must be birds.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "51e6e1c1-ce40-415c-b2ac-753b7f19d3c3",
        "syllogism": "Hammers are items that are tools. It is the case that no glove is a tool. It can be concluded that no glove is a hammer.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "dc5e8a17-f9ee-4f1c-a6e1-e55e3893609d",
        "syllogism": "All things which are ghosts are scientific facts. All things which are ghosts are mythical beings. It follows that some mythical beings are scientific facts.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "44ec00e8-6a39-473e-94e8-d90a52360f1f",
        "syllogism": "Every object that is a flower is an animal. Anything that is a rose is an object that is a flower. This means that every rose is an animal.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f6b34421-9ef7-42fc-b441-393edd441d41",
        "syllogism": "It is not true that any stationery item can be used for writing. All pencils are items of stationery. Therefore, no pencil is able to be used for writing.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "8abb5cfd-db81-4fe4-8c3c-f25e8f2bdb74",
        "syllogism": "Every single apple is a vegetable. Anything that is an apple is a fruit. From this, it can be stated that some fruits are vegetables.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "892da397-cedc-4341-b9d1-d59eb6ed7865",
        "syllogism": "There are no amphibians that do not live on both land and in water. Every single frog is an amphibian. There exists at least one frog that lives on land and in water.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "31d135e6-37bd-449a-b01e-2dd1d4c48111",
        "syllogism": "There are no roses that are vegetables. A certain quantity of roses are flowers. This logically implies that some flowers are not vegetables.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "ffba71c8-04fc-496e-809f-6655735d3be8",
        "syllogism": "Every feline is an animal. There is a subset of animals that is composed of mammals. A portion of mammals are not felines.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "11c65905-5cf1-495e-aa9e-720c9f8687fd",
        "syllogism": "No buildings are found within the group of plants. The category of trees is entirely made up of plants. Buildings and trees are completely separate categories.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "3fd2289b-672d-490c-a5d6-61d711814d7f",
        "syllogism": "No gold is silver. Silver is, without exception, a metal. A number of metals are gold.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "5580c76a-7c97-4b7a-a43d-d12866c99ae2",
        "syllogism": "Everything that is a planet is a celestial body. There are no things that are Earth that are not planets. Therefore, at least some Earth is a celestial body.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1258c011-5342-478f-aed4-de905c7a0ce5",
        "syllogism": "It is true that no bird is an insect. Every single insect is a mammal. This proves that all mammals are birds.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "50decd9c-f2ed-430f-8103-bc9a386d1f5b",
        "syllogism": "A computer is never a tablet. All of the tablets are, without exception, electronic devices. A subset of electronic devices is not composed of computers.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c9a543c7-82de-4734-a9e2-e059894c58b4",
        "syllogism": "It is not true that any input device is used for typing. Each and every keyboard is an input device. It is therefore a fact that no keyboard is used for typing.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "38d07379-8307-4a7f-a73d-731ed989dc84",
        "syllogism": "The group of birds is a subset of the group of creatures with feathers. At least one insect is not a creature with feathers. Not every insect is a bird.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "fe3ded4a-77a5-405e-8edb-2cc97d6fa84d",
        "syllogism": "Every shoe is a type of footwear. Nothing that is a sandal is a type of footwear. It is the case that no sandal is a shoe.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "55542618-500d-49c5-95d5-a522bc938522",
        "syllogism": "There are some vegetables which are apples. Everything that is an apple is an aquatic mammal. This necessitates that some aquatic mammals are vegetables.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "be226ccb-e7b4-4f8c-b7d0-ef9640c705cb",
        "syllogism": "Anything which is an animal is a flightless thing. Every single bird is an animal. There are no birds that are not flightless.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "0a5ff024-0265-4fe8-8dd7-57dd3d61a466",
        "syllogism": "There exist no creatures that are both fish and reptiles. There are no lizards which are fish. It is therefore the case that some lizards are reptiles.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "b8ce3ed1-0261-4bf8-b8c3-4022ae92ee7f",
        "syllogism": "Nothing that is a bird is also a mammal. It is known that some pets are mammals. Consequently, some pets are birds.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "3930cca0-23f8-465b-a869-6199c3415dc2",
        "syllogism": "All of the things that are windows are animals. All of the things that are doors are animals. It can be deduced that there are doors that are windows.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "46521c95-a338-47b0-96dd-a68ba25c5a34",
        "syllogism": "It is a fact that every single soda is a liquid. Likewise, it is true that all water is liquid. Therefore, it has been asserted that every bit of water is soda.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "dc79b4b7-8f59-43b5-8414-6c5cb46e94c7",
        "syllogism": "Every single liquid is wet. All solids are also wet. Therefore, nothing that is a solid is not a liquid.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6ee9c1d0-989a-4ff4-a935-021d6e294533",
        "syllogism": "It is true that everything that is a sun is a star. It is also true that all stars are celestial bodies. Thus, it is concluded that all celestial bodies are suns.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "50008a27-be0f-44a2-a7ad-bb41c1b54ac5",
        "syllogism": "Anything that is a human is a mammal. There are some apes that are mammals. Some apes are not mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "ef813b31-ae4f-4041-b9cc-b1d3378ba884",
        "syllogism": "Every single fruit contains seeds. Anything that is an apple is a fruit. A number of apples contain seeds.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "5837618c-ebb9-414e-b085-208c1437a3fc",
        "syllogism": "None of the things that are shrubs are plants over 20 feet tall. Anything that belongs to the class of trees is a plant over 20 feet tall. Trees and shrubs do not belong to the same group.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1147615b-a8a5-4626-8e2d-171220edf00d",
        "syllogism": "Some of the planets are animals. All animals are living things. As a result, some living things are planets.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "d6151c99-5b23-4164-b1b2-c51ce19b5c73",
        "syllogism": "Every single priest is a person. All priests are human. It follows from this that every human is a person.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "b67cba63-9ae7-4878-a8a7-f7e663f58bcc",
        "syllogism": "A car is never an airplane. It is also the case that no boat is an airplane. Consequently, all boats are cars.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6c70f8c4-cfed-4ee2-9de2-0ad6c7e39a4d",
        "syllogism": "There are no fish which are mammals. No cats are considered fish. Some felines are not mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "11bab54e-dbbb-4b2e-9d4d-2fc9b2c69d9e",
        "syllogism": "It is a certainty that every single teacher is a human being. It is also true that a few educated people are human beings. On this basis, it has been stated that a few educated people are teachers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "5663e778-8153-48c2-83b3-c559449cfb13",
        "syllogism": "Nothing that is a robot is an organic being. Every single person who is a human is an organic being. It follows from this that there are a number of humans who are not robots.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a7b40ecc-5e8f-4fcd-9c62-cbfe30351899",
        "syllogism": "Anything that is a human is a mammal. Everything that is an ape is a mammal. No apes are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d10c848c-ce58-4a0c-b56b-3f75b2ca0bfc",
        "syllogism": "Any object that is a body of water is a gas. Nothing that is an ocean is a gas. There exists at least one body of water which is not an ocean.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "55a5e039-5ab2-479a-84d6-55d177cc648d",
        "syllogism": "There are no vegetables that can be described as fruits. Carrots are, in every instance, vegetables. Therefore, it is certain that no carrots are fruits.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "80ba297a-c9c9-4925-851e-72eb42dafd61",
        "syllogism": "Every person who is a politician is a mortal. All mortals are humans. Consequently, every single human is a politician.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "19bc7c4d-5dfa-409e-b62b-16e82606eb24",
        "syllogism": "There are no trees that are living organisms. Every single item which is a plant is a living organism. This implies that all plants are trees.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "289953c0-645f-47c9-92a3-35b7fbadbf2f",
        "syllogism": "Anything that is an oak is a plant. There are oaks that are trees. It must follow that every single tree is a plant.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "091c270b-32c3-44b5-ac07-f147bfe049fd",
        "syllogism": "There are no trees that are also animals. Every single tree is a plant. It is the case that some plants fail to be animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "ff2717d7-987b-4b07-b9a8-a228207e5ffa",
        "syllogism": "The set of stars and the set of celestial bodies that orbit other celestial bodies are mutually exclusive. Nothing that is a planet is a celestial body that orbits another celestial body. The entire group of planets consists of stars.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "53331624-13d7-4d3d-b3d7-3c5cb0aff3d2",
        "syllogism": "Anything that is a fruit is not a baked good. All of the things that are apples are fruits. Thus, some of the things that are apples are not baked goods.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1677a357-b1cb-40ad-adce-909007c0bca3",
        "syllogism": "Each and every kitchen is a room. Each and every kitchen is a place for cooking. This implies that some places for cooking are rooms.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "45ff036a-75a0-4f0f-bad0-4ed93ea7046b",
        "syllogism": "All fish are birds. It is true that no bird is aquatic. It follows that no aquatic thing is a fish.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "951df8bb-e9dc-4272-9db7-92fe5d28d337",
        "syllogism": "Anything that is a dog has fur. There are some poodles that are dogs. There are no poodles that do not have fur.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f942476a-e905-4659-a4a0-b5aa00622fbc",
        "syllogism": "The group of humans and the group of people have nothing in common. All of the things that are men are people. Men are not humans.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "70b2849f-72c6-4f1f-9fff-8c159405b8c8",
        "syllogism": "All of the things that are robins are birds. There are no birds whatsoever that are fish. It logically follows that no fish are robins.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c18abe00-c1e3-419e-b081-30fb76b046de",
        "syllogism": "It is a fact that every single dog is a mammal. Likewise, it is true that all poodles are mammals. Therefore, it has been asserted that every poodle is a dog.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8d571f6e-3af0-4428-b572-365fbc4f139d",
        "syllogism": "A creature that is a dog is never a mammal. Among the creatures that are dogs, a group are retrievers. One can infer from this that some retrievers are not mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "7fccb781-3cf9-4aaf-8ec4-efcad82df3b3",
        "syllogism": "There are people who are students. A few children are students. It follows, then, that some children are people.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "4a6f96f2-f3fb-414b-88b2-ec007c595e9b",
        "syllogism": "No car is a boat. Some vehicles are not cars. Therefore, all vehicles are boats.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "adc52cf4-381b-4203-8745-cee844d750b1",
        "syllogism": "There are no cars that are boats. There is not a single ferry that is a car. Consequently, some ferries are boats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "5a74296e-6a5d-4aaa-9cad-23d3c6b98e12",
        "syllogism": "Every single vegetable is a plant. Anything that is a carrot is a vegetable. Therefore, all carrots are plants.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1a8a31a0-21a8-4372-8d78-084d54b33d20",
        "syllogism": "There exist some apples that are fruits. Anything that is an apple is edible. Thus, some edible things are fruits.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "76f5bd8e-eb80-4bb9-983b-49ce10706337",
        "syllogism": "Every single creature that is a dog is also a mammal. There are some jack russels which are dogs. It necessarily follows that some jack russels are mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "07a90f4b-0f4f-4cd1-98e4-fb8d24f15662",
        "syllogism": "Every single dog is an animal. There are no zebras which are canines. It is the case that some zebra is an animal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "075ee36a-6966-403e-b55e-288e2358c226",
        "syllogism": "There are no eagles that are mammals. Every single eagle is a bird. It is implied that some birds are not mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "462a2603-e5b1-4dc2-bc70-152c024816e0",
        "syllogism": "Every insect is an animal. All reptiles are animals. Consequently, every single reptile is an ant.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "1ddd8a6a-d17b-4723-b115-a245cd44028d",
        "syllogism": "Anything that is a liquid is a fluid. Every single gas is a fluid. This means that all gases are liquids.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "58415d94-edbc-4d45-8c14-128c99bb2da5",
        "syllogism": "Every human is a being that has eyes. It is the case that no dog is a human. At least some dogs have eyes.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "4d7b1239-23dc-46e3-bbfa-a455fde88d27",
        "syllogism": "Dogs are in no way mammals. Anything that is a dog is a canine. There are some canines that are not mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "fd1c29dd-41e2-4937-bd16-11dc1dfc6802",
        "syllogism": "All machines are humans. There are at least a few students who are not humans. At least one student is a machine.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "85898b99-2e8c-49ee-8595-1a1c9cdf12e6",
        "syllogism": "Every single fish is a creature. Every bird is a creature. All birds are fish.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "60fe7ed8-873b-4fb0-ac87-1dc330032a3a",
        "syllogism": "There are no birds which are insects. There is no fly that is a bird. It follows, then, that some flies are insects.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "3f27ae02-9e64-4c34-96d4-4e241a1c356c",
        "syllogism": "No item that can be described as a cat is a dog. There exist pets that are dogs. We must conclude that some pets are not cats.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "13b6fa09-35e7-4bf1-9bee-12474c668503",
        "syllogism": "There exists no dog that is also a plant. There are no humans who are plants. The group of humans and the group of dogs are mutually exclusive.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "1ddf5f37-b195-43ff-a681-6bbf256e74e0",
        "syllogism": "There is a person who is both a politician and a lawyer. The group of senators includes people who are lawyers. The consequence is that some senators are politicians.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "9b4f2ed1-786d-4b4f-a076-2c5dcfdc637b",
        "syllogism": "Anything that is a flower is made of metal. Every single rose is a flower. At least one rose is made of metal.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a2c6000f-14cf-4763-98a8-247ebc65773f",
        "syllogism": "Every single thing that is a truck is a vehicle. It is the case that a number of pickups are vehicles. Consequently, some pickups are not trucks.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "66becbb7-c25e-4311-9351-8ae03584a7f6",
        "syllogism": "There are no animals that are both fish and warm-blooded. The entire group of mammals consists of animals that are warm-blooded. Fish and mammals are mutually exclusive categories.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "4510d170-3c4e-455b-a819-2c2e88fe1655",
        "syllogism": "Every single reptile is a living thing. The set of animals contains no living things. Not a single reptile is an animal.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "dff7e3d0-0d22-47b4-a2df-100757a822f5",
        "syllogism": "Anything that is a fish can fly. It is also the case that every single bird can fly. From this, it can be concluded that all fish are birds.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b436f6f9-ef9a-4109-9d2e-6c1de2d3bea0",
        "syllogism": "There are some sweet foods that are cakes. There are no cakes that are salty foods. It is the case that no salty foods are sweet foods.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "290712e0-73c5-4144-af4e-1ffca0c6ed18",
        "syllogism": "Not a single thing that is a machine is an animal. It is known that a portion of cars are machines. Thus, it must be true that some cars are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "7af1f61d-43ed-4320-b76a-3f4137373e22",
        "syllogism": "Anything that is a priest is a man. Every single pope is a man. It is necessarily concluded that every pope is a priest.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fc0f46f1-7745-4e5b-8448-f15f54ba1970",
        "syllogism": "There is no machine that is a chair. A few chairs happen to be things that are made of wood. Therefore, some things made of wood are not machines.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "8a7cff1f-9701-43ed-81cb-17e5fe597f0f",
        "syllogism": "Every single house is a thing that is a building. A shed is never a thing that is a building. It follows that no shed is a house.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "7365d303-9046-46f0-8fdc-d668a2845007",
        "syllogism": "There are no parrots which are mammals. Some birds are parrots. This implies that no birds are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "1d4de649-8f04-436a-b489-abb438c23bcb",
        "syllogism": "Every single bird has the ability to read novels. There exist some pigeons which are birds. Therefore, some pigeons can read novels.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "c734ea25-7d1d-4611-b3f5-9a7a5928bb21",
        "syllogism": "Nothing that is a land animal is an aquatic animal. A certain number of hippos are to be found among the land animals. Thus, it can be concluded that some hippos are aquatic animals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "777cdc8f-1a66-4ad2-bf27-633f430f0183",
        "syllogism": "There are no vehicles that are made of metal. Every single car is a vehicle. This means that no car is made of metal.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b4528712-3ba2-4790-8758-0b31c91d3d20",
        "syllogism": "Some writers are also poets. It is known that some novelists are writers. It has been said that some novelists are poets.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "68e9865c-5c39-473d-84ab-16216fa77d7e",
        "syllogism": "Every single organism that is a fish lives in trees. Anything that is a salmon is a type of fish. It is necessarily concluded that all salmon live in trees.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f37a0e86-98bb-459b-8d6d-60b3455de955",
        "syllogism": "Any and all humans are mortal. It is a known fact that all humans are primates. Thus, every single primate is mortal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "26d7b707-2358-4873-bc57-d4aa724f7f22",
        "syllogism": "Anything that is a sparrow is also a bird. There are some bats which are not birds. This necessarily means that some bats are not sparrows.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "4f301646-128a-4478-96f3-94ddd9ba282d",
        "syllogism": "There are some animals that are not mammals. Everything that is a dog is a mammal. Thus, every dog is an animal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "5ab729fc-d0d1-45fa-8588-7b270389800f",
        "syllogism": "Anything that is a poet is also a writer. All writers are people who are creative. We can conclude from this that a portion of creative people are poets.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1b1b97d3-969d-4921-9095-42863228cbab",
        "syllogism": "Anything that is a mammal is a creature that is warm-blooded. Some animals are, without a doubt, mammals. Therefore, every single animal is made of wood.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "7b01a111-ae3b-4cf5-85ea-31dfe1da204c",
        "syllogism": "It is the case that every single stone is a cloud. Anything that is a cloud is an animal. Therefore, a few animals are stones.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "348536c7-1f02-4527-9794-f6ab7fdf1144",
        "syllogism": "Nothing that is an emotion is a feeling. Certain emotions are classified as sadness. It must be the case that some sadness is not a feeling.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f3fecb37-13d4-413b-b97c-7bd23d52e3f8",
        "syllogism": "It is the case that no liquid is a fluid. All water is a liquid. Consequently, some of the water is not a fluid.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "8078870d-5ee2-4765-a771-bd795e0a10cf",
        "syllogism": "There are no paintings that are also works of literature. Every single novel is a work of literature. The implication is that there exist some novels which are not paintings.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "6a373226-2cee-4447-a3e5-1edd8c8af430",
        "syllogism": "There exist vegetables that grow. Every single vegetable is a plant. It follows that not a single plant is a vegetable.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "977d509f-bff0-4f82-b5bb-440e1ce5f8d0",
        "syllogism": "Anything that is a square is a quadrilateral. There are no shapes that are triangles which can also be described as quadrilaterals. There exist certain triangles that are not squares.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e6449020-f9d5-4bc0-b0a2-561fa0d15d30",
        "syllogism": "The group of professionals is a subset of the group of people. Everything that is a doctor is a professional. Therefore, there are some people who are not doctors.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8485cc49-e043-42b7-ae68-49245e4954fe",
        "syllogism": "Anything that is a car is a vehicle. Every single sedan is a vehicle. This means that all sedans are cars.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "42ac3db3-2da4-4208-9db9-9affc3d18dc4",
        "syllogism": "It is true that some things that are trees are not oaks. Everything that is a tree is a plant. It follows that there are some plants that are not oaks.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "930de84a-a92b-430d-893f-263036dbffec",
        "syllogism": "There are some vehicles that are machines. Every single car is a vehicle. It is therefore the case that every car is a machine.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8040b38f-9c99-420a-b661-c0897591b31b",
        "syllogism": "Anything that is a liquid is not a solid. There is no water that is a liquid. Consequently, every drop of water is a solid.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6904b1e8-8a48-4ef1-b450-d8f54773bf96",
        "syllogism": "It is not true that any flower is a plant. All things that are roses are flowers. Thus, some roses are not plants.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "13f2e9a6-8df5-459d-987d-2348f712aadc",
        "syllogism": "There are some creatures that are mythical that are centaurs. Every single one of the centaurs is a domesticated animal. Consequently, it is the case that some domesticated animals are mythical creatures.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f487c925-ab9d-43a0-9139-1a598deacc51",
        "syllogism": "There are no vegetables that are apples. Among the apples, a few are red fruits. Not all red fruits are vegetables.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a45774a3-287d-449e-8015-57d0a0b6e3d4",
        "syllogism": "There is nothing that is a canine which is also a feline. Every animal that is a dog is, by its very nature, a canine. It can be logically concluded that no dogs are felines.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "675842ed-60c4-40ab-9f9b-cf0c90280d88",
        "syllogism": "Every single human is not a fish. There are a few fish that are also creatures that live in water. It is the case that not all creatures that live in water are humans.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "b62e49b6-12d4-47d9-87df-e7df1d978057",
        "syllogism": "There are no animals that are rocks. It is also true that no cats are rocks. Therefore, it is argued that there are no cats which are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8da50b76-04db-4f6c-b820-de5f57498334",
        "syllogism": "It is the case that all actors are performers. There are some men who are actors. Therefore, we can derive that some men are performers.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "475ce940-a63d-4940-9254-be1e35243cfa",
        "syllogism": "There are some dogs that are cats. There are no cats that are reptiles. As a result, some reptiles are dogs.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "a387bf65-5020-4833-bfed-c12eb551e259",
        "syllogism": "Every single country has a capital city. The entity known as France is a country. There is at least some part of France that has a capital city.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a6abf627-c349-4eff-9138-1989a2c50491",
        "syllogism": "The group of creatures that have eight legs does not intersect with the group of arachnids. All of the arachnids are spiders. It must be the case that a portion of spiders are not creatures that have eight legs.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "baeb9911-e69d-433c-9934-36988fdc2f53",
        "syllogism": "It is the case that no bird is a reptile. A portion of the penguin population are birds. Thus, some penguins are excluded from the group of reptiles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c0f8e211-64fb-4b10-8a12-14d0def3f5b9",
        "syllogism": "Every single liquid is wet. It is known that no sand is a liquid. Consequently, there are no things made of sand which are wet.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c81d6f35-5656-4c9e-8e8c-bd50cbc341e5",
        "syllogism": "There are no plants that can be called trees. It is also true that every plant is a type of vegetable. This has led to the conclusion that every vegetable is a tree.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "fe7ee440-ef75-481a-b562-4bd665bb11c9",
        "syllogism": "Anything that is a table is not a tree. There are tables, and some of them can be identified as furniture. Based on this, a portion of furniture pieces must not be trees.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "59598fb3-62fa-42dd-9498-8ae6fdc51cbc",
        "syllogism": "Every mammal is an animal. Every fish is an animal. This suggests that some fish are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "4a0e2133-b509-468a-8d8c-93362fc9cc82",
        "syllogism": "Every single tree is a thing that is alive. Anything that is a plant is alive. At least one plant is a tree.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f6b85a4a-31b9-4180-b404-3890742180a2",
        "syllogism": "There is no square that is a circle. Some of the shapes are squares. Therefore, it is the case that some shapes are circles.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "02a6d9c3-9704-4290-905b-f427482c06c8",
        "syllogism": "It is true that every pen is an object. Some things are not pens. From this, it can be claimed that some things are not objects.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "81346be1-76d7-4051-b57c-05f0145dcd9c",
        "syllogism": "There is no overlap between living things that can breathe oxygen and rocks. All things that are rocks are animals. Certain animals are not living things that can breathe oxygen.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "eff0c9a8-448c-42ea-a85d-516e2cfa8a91",
        "syllogism": "It is the case that no mammal is an animal. There are some dogs that are animals. It must be the case that some dogs are not mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0112296e-72b9-40a8-89d9-6423f59a958a",
        "syllogism": "Every triangle is a shape. No circle is a triangle. Therefore, no circle can be a shape.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "97bd1911-5aca-41a1-ba6f-835f2ba45abf",
        "syllogism": "Every cat is a mammal. The set of dolphins contains no cats. Every single dolphin is a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ac9700ee-cf8e-428b-9f4a-88a7a21a73bf",
        "syllogism": "Every cat is an animal. There are a number of dogs that are animals. It follows from this that every single dog is a cat.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "92732329-128c-43fa-a364-94c90d08162f",
        "syllogism": "Every single car is a type of vehicle with an engine. There exist some bicycles that do not have an engine. It is the case that some bicycles are not cars.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "050b76be-03f5-4435-a74d-9e93cefce5f5",
        "syllogism": "It is a fact that all cats are felines. Everything that is a feline is a mammal. Therefore, every single mammal is a cat.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f00f038d-2271-4b3f-9044-069732724dd5",
        "syllogism": "Any creature that is a bird is an animal. A portion of animals are kept as pets. Some pets are not birds.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "da09c581-be6d-4d5e-952c-94c944e8a751",
        "syllogism": "Every fruit is an object that contains seeds. Without exception, all apples are fruits. It can be concluded that every apple contains seeds.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1e137e72-636d-4cc6-9547-2266ee83ed53",
        "syllogism": "There are no moons that are also planets. Everything that is a planet is also a celestial body. Some celestial bodies are not moons.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "cbfc916b-9232-4bcb-8641-edcf556260a0",
        "syllogism": "Nothing that is a fiction book is a biography. Some novels fall under the category of fiction books. This allows us to state that some novels are not biographies.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "b0363392-5e97-4d9d-b9a5-6e3af4510d4e",
        "syllogism": "Mountains cannot be oceans. Every mountain named Everest is a mountain. It must be that some mountains named Everest are not oceans.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "68943d30-671d-4073-9a96-ee59872b9843",
        "syllogism": "There exist no machines that are also humans. Anything that can be called a student is, without exception, a human. No students are machines.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9deb885f-2862-4ceb-86b7-c0fbc19e2691",
        "syllogism": "Not a single rock is an animal. Every single item which is a dog is a rock. This implies that some dogs are animals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "47de8cdb-8488-455b-bb84-d99fce683591",
        "syllogism": "Anything that is a triangle is not a shape with three sides. Every single thing that is an equilateral triangle is a triangle. Therefore, it is the case that some equilateral triangles are not shapes with three sides.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f15e7b0d-2dab-45f1-b6cf-7d62415c7119",
        "syllogism": "It is the case that no computers are laptops. It is also true that no tables are computers. From these statements, it can be concluded that some tables are laptops.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "5207dc42-0a3f-40d0-b022-43b3864dc8b1",
        "syllogism": "Every single star is a planet. No planets are suns. It is therefore a sound deduction that some suns are not stars.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f9127a5c-d34b-4472-aa6f-82d8c32f0c42",
        "syllogism": "Anything that is a human is a mortal. All things that are trees are mortals. This means that everything that is a tree is a human.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "cf153c16-caa8-4381-ba89-271ab817b327",
        "syllogism": "A smartphone is a tool. Everything that is a tool is a robot. This is why every robot is a smartphone.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "9cab23f7-fba3-4286-ad44-0fe56268ff98",
        "syllogism": "There are some planets which are roses. All roses are, in fact, flowers. It follows that some flowers are planets.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "96b67dc0-7b49-45dd-9435-5e34c73a408d",
        "syllogism": "Nothing that is a vehicle is able to fly. Each and every airplane is a vehicle. It is therefore a fact that no airplane is able to fly.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "893389ed-b336-4b90-9b1c-9f6bcc595862",
        "syllogism": "None of the things that are cats are aquatic animals. All tigers are things that are cats. It follows logically that some tigers are not aquatic animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "7ac17eef-bc85-42eb-a4bd-0c356cb90ad2",
        "syllogism": "Every single thing that is a dog is a mammal. Anything that is a cat is a mammal. From this, it can be stated that some cats are dogs.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f8f7078c-79ba-4085-8343-21a4b63d4c21",
        "syllogism": "There exist some individuals who are artists that are not painters. Every single person who is an artist is a creative person. It follows that some creative people are painters.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "7f48e605-47b8-4f1d-914c-d0f3c42593a3",
        "syllogism": "It is not true that any mammal is a fish. There are a few fish that are also humans. There are some humans that are not mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "9d0f6e59-163b-4aac-bede-cac5938a90a3",
        "syllogism": "Everything that is a living organism is a thing that consumes energy. Any and all plants are things that consume energy. This means that all plants are living organisms.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "17888115-1faa-438c-8260-5dc06d9c0c64",
        "syllogism": "It is true that some Europeans are people. Among the items that are Germans, some are people. The only conclusion is that some Germans are not Europeans.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "4c424337-e384-43c6-a130-fcc14a34f3fb",
        "syllogism": "Everything that is a cloud is also a reptile. Everything that is a cloud is also a fish. Hence, some fish are reptiles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "cd4bdf9a-bb6a-49bc-973b-bd0aa6c4b732",
        "syllogism": "Any item that is a tree is a plant. It is the case that a portion of pines are plants. Therefore, not all pines are trees.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "484629f1-3062-4086-b455-4892eb08d4e6",
        "syllogism": "Nothing that is a fruit is broccoli. All items of broccoli are vegetables. A subset of vegetables is not fruit.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e1f1def4-57f6-41e8-8e37-11c23329583c",
        "syllogism": "There are some buildings that are not skyscrapers. All buildings are considered structures. It is therefore true that some structures are not skyscrapers.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "d7afe323-d509-4dec-a2e0-28e03a26902e",
        "syllogism": "Not one single nonfiction book is a fictional work. All novels are fictional works. It follows from this that some novels are not nonfiction books.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9a3154a2-4a7e-4f26-ae0d-e97e2cec7ef0",
        "syllogism": "Some fast food restaurants have a drive-thru. There are coffee shops which are also fast food restaurants. It follows, then, that some coffee shops have a drive-thru.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ea4ed2ab-8c5b-43f2-b726-218533f2939f",
        "syllogism": "Every single vegetable is a planet. Anything that is a planet is a musical instrument. It is a logical necessity that some musical instruments are vegetables.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "e1d85847-da07-45e8-aae3-34ee3008c4b7",
        "syllogism": "Every mammal is a thing that is an animal. There is not a single dog that is an animal. Consequently, no dog is a mammal.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a118c2fa-37f7-4086-a209-5fb8b90e4c78",
        "syllogism": "The category of moons and the category of celestial bodies do not overlap. All celestial bodies are planets. A subset of planets are moons.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b3b36ad2-d5c0-4e89-834d-65bb2d69c3c4",
        "syllogism": "There are no rocks that can be classified as plants. Some granite is included in the category of rocks. Consequently, it follows that some granite is not plants.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c648392e-e91c-4046-97fc-4acb588a0a42",
        "syllogism": "Every single creature that is a pig is capable of flight. There are some farm animals which are pigs. Therefore, a portion of farm animals can fly.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5c343f7b-d752-4ebe-92c2-1055da055868",
        "syllogism": "No liquids are cats. Some dogs are liquids. It is concluded that some dogs are cats.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "5938206b-fa51-46ed-8a8d-549d39ee4249",
        "syllogism": "Not one cat is a pet. Everything that is a cat is a mammal. It follows that all pets are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b41d3226-616d-475f-8112-11a869a6cfa7",
        "syllogism": "The set of artists contains no people who conduct systematic research. Every single scientist is a person who conducts systematic research. Artists are not scientists.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "34b58acf-6301-4373-90cc-aa8b04fb151d",
        "syllogism": "It is the case that all dogs are mammals. No cats are dogs. It follows that no cat is a mammal.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8723ea49-3989-4559-86ee-efe1fbd90384",
        "syllogism": "There are no birds that are fish. It is the case that some parrots are birds. We can conclude that no parrots are fish.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "c061e039-e726-41ad-a8a6-e782b7bf417b",
        "syllogism": "The class of insects and the class of creatures with eight legs do not overlap. All creatures with eight legs are spiders. A subset of insects are spiders.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "bcaacbd3-c582-4316-bc1c-327a00965f63",
        "syllogism": "Every single cloud is a vehicle. There are no clouds that are buses. Therefore, there is no bus that is a vehicle.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "06689352-cd51-48f4-8767-0864666d0941",
        "syllogism": "Anything that is a novel is a book. All books are publications. From these facts, it is clear that a few publications are novels.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "2351a576-f65f-4566-b885-6dfc14525c09",
        "syllogism": "There are no reptiles that are humans. It is also true that no ant is a reptile. It follows that no ant is a human.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "72458ea2-0688-472b-bb76-2790c794ba46",
        "syllogism": "There are some animals that are mammals. There are no mammals that are birds. It follows from this that some birds are animals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "80d2725e-50ab-4668-81c2-5d009dab1bec",
        "syllogism": "Liquids are in no way substances. Anything that is a liquid is a fluid. It's the case that some fluids are not substances.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "cf2dcde2-450d-45e2-b775-0f97c9ebb406",
        "syllogism": "Every single piece of gold is a precious substance. No plastic is gold. It follows that no plastic is a precious substance.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "0e536e76-40a1-4af6-b344-b2e04598d3bc",
        "syllogism": "Every novel is a work of fiction. No work of fiction is a news article. It is thus the case that no news article is a novel.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "ec3d4144-b083-43d2-a400-20da589c8627",
        "syllogism": "It is true that everything which is a bird is a winged creature. There are no insects which are birds. A conclusion that can be drawn from this is that there are no insects which are winged creatures.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "aa8571b5-b9e0-4010-b67d-dcf832c29429",
        "syllogism": "Anything that is a tree is a musical instrument. There are some oaks that are not musical instruments. This leads to the conclusion that some oaks are not trees.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "fc9ba5ef-3933-4ed5-a40a-d70c483eee95",
        "syllogism": "Anything that is a car has an engine. It is the case that no bicycle is a car. No bicycle has an engine.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "b3a91f20-41e0-45b3-a152-92f28e8999c1",
        "syllogism": "It is not true that any insect is a creature with eight legs. Every insect is a spider. It follows that every spider is a creature with eight legs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "1e545339-9d43-4dc5-8d0a-8a64858b3fbb",
        "syllogism": "A few shoes are fruits. Every single fruit grows on a plant. It can be deduced that some things that grow on plants are shoes.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0092296f-5c8d-4c79-9641-8df244a2c6ba",
        "syllogism": "Absolutely nothing that is an aquatic animal is a feline. It is the case that some cats are aquatic animals. Thus, not all cats are felines.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "cc170ddf-ad97-48d0-aa6f-ec21373c1c9c",
        "syllogism": "There are no things which are animals that are plants. Everything that is a tree is a plant. Consequently, there exist some trees which are not animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c5d0501c-c25b-40c1-91c0-603b613de0cf",
        "syllogism": "Not one single doctor is a person who performs on stage. Every single musician is considered a person who performs on stage. Consequently, there exist some musicians who are not doctors.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1be779ce-f518-4780-9c11-ddbdfb91a860",
        "syllogism": "Fathers are in no way humans. Anything that is a father is a mother. There are some mothers that are not humans.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ace56295-ca7c-490f-b69b-8f1293edeede",
        "syllogism": "Everything that is a car is a sentient cloud. All sentient clouds are plants. This means that some plants are cars.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "74516312-5969-4166-b84e-a34afc2d12bf",
        "syllogism": "All sedans are cars. Every sedan is a vehicle. Therefore, all vehicles must be cars.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "22a7186f-60ee-4566-8853-3f3f07b652b3",
        "syllogism": "There are no flying creatures which are birds. A certain number of sparrows are flying creatures. It follows that not all sparrows are birds.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "664267a1-59e1-481f-a04a-191ed6ed7a83",
        "syllogism": "No fish are creatures with fur. All of the animals that are considered mammals are creatures with fur. Consequently, it can be said that some mammals are not fish.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "6dfa2e90-5139-4564-bb80-b6c343f867b0",
        "syllogism": "Nothing that is a vehicle is a mode of transportation. A certain number of cars are composed of vehicles. It follows that a portion of cars are not modes of transportation.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b99063c8-66a9-43a6-add5-5a10d18780d2",
        "syllogism": "It's the case that all furniture is made of wood. Anything that is a chair is also made of wood. Some chairs fail to be furniture.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8c994dd2-d609-47b8-b002-c10f92225451",
        "syllogism": "Every single dog is a mammal. All mammals are birds. Consequently, every single bird is a dog.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "fdd91c7e-cceb-4813-898c-9dd9159f5305",
        "syllogism": "Anything that is a stone is soft. Every single diamond is a stone. A certain quantity of diamonds is soft.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5442d653-ac16-4a02-a968-da6ac2c6d636",
        "syllogism": "There is no fish that is a mammal. There are no dogs that are mammals. It can be deduced that there are no dogs that are fish.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "d33723e6-311d-4079-9752-a198fcfb0180",
        "syllogism": "There are no polygons that are shapes with three sides. All triangles are shapes with three sides. The implication is that some triangles are not polygons.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0cb166c1-cc61-4585-bf4b-baad5b3028a2",
        "syllogism": "Every single liquid is a fluid. There are some water bodies which are liquid. Water is in no way a fluid.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "45fcf3e0-d667-4856-8268-4df37fd3a8bb",
        "syllogism": "There are some animals that are birds. It is a fact that some animals are not fish. It must be the case that no fish is a bird.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ca7aa5a8-fa01-460c-9791-99317715aa93",
        "syllogism": "Every single dog is capable of photosynthesis. There exist dogs which are poodles. This implies that a portion of poodles can photosynthesize.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "1638fd0c-b370-4d7a-8036-97f0468e886d",
        "syllogism": "There are no shirts that are also pants. It is true that no jacket is a pair of pants. Therefore, we can conclude that a few jackets are shirts.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "5f470790-9bf1-4f1f-898e-c7d7ca738cf9",
        "syllogism": "There are no mythical creatures who are people. A few mythical creatures are aliens. It is the case that a portion of all aliens are people.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "90ae3f81-b254-45fb-99c6-1636309c7715",
        "syllogism": "Every dog is a mammal. All cats are also mammals. Therefore, it must be that some cats are not dogs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "31c63f8f-d490-467e-a885-4dfe4bfddc8b",
        "syllogism": "Anything that is water is also an H2O molecule. There is no ice that is an H2O molecule. Therefore, ice cannot be water.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "020fa6a9-78fa-42d2-987a-7aa9c21ed5ff",
        "syllogism": "There are some smart people that are physicists. Every physicist is a scientist. As a result, every single scientist is a smart person.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "6b8e7633-e0e5-4bd2-808f-97bd90d5a065",
        "syllogism": "Every single vegetable is green. Anything that is a leaf is green. It is necessarily concluded that every leaf is a vegetable.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "e678f76a-260f-4b2f-b2c6-3d3a5a992e6d",
        "syllogism": "There are no objects that are furniture. Each and every table is an object. It follows that no table can be an item of furniture.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "bcf96192-4ae8-4834-ab5d-7b2f8c36465b",
        "syllogism": "There are no animals that are both carnivores and herbivores. A certain number of wolves are carnivores. It follows that no wolves are herbivores.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8acb7e95-5790-4e97-abde-feb0e3b60129",
        "syllogism": "Every single nurse is someone who can fly. A few nurses are doctors. Therefore, a certain number of doctors can fly.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5014a30a-93f6-421c-900d-175499c326ff",
        "syllogism": "There are no stars that are planets. Each and every star is a celestial body. It is therefore true that every celestial body is a planet.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "19e7c1c2-9130-43bd-abfc-f7cbaf4c2a6b",
        "syllogism": "Anything that is a planet is secretly a robot. Every single thing that is secretly a robot is a living thing. From these facts, it is clear that a few living things are planets.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "09a2e249-2d06-47db-a7cb-d6da64814054",
        "syllogism": "There are no vegetables that are fruit. It is the case that no fruit is a potato. Therefore, some potatoes are not vegetables.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f0e91b6c-be2c-4558-b627-2ecb7b09e00a",
        "syllogism": "It is not the case that animals are non-birds. Of the items that are hummingbirds, some are non-birds. It must be the case that every single hummingbird is not an animal.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "a938e32a-2811-4406-8d78-092fc55e1eb5",
        "syllogism": "Stars are in no way celestial bodies. Anything that is a star is a planet. It's the case that some planets are not celestial bodies.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3b1f2da1-913d-4fef-a40b-394545bdd73d",
        "syllogism": "There exist mammals who are cats. Every single dog is a mammal. It follows that not a single dog is a cat.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fda01b69-75f5-4d16-8604-0ddb8cdec3c1",
        "syllogism": "Every single grape is a fruit. There exist some carrots that are not fruits. It must be that some carrots are not grapes.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "31696c08-057b-4e85-9a88-c730c82831da",
        "syllogism": "Every person who is a child is a mortal. All mortals are humans. Consequently, every single human is a child.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "25865228-432c-496c-997a-304fdb99a0c3",
        "syllogism": "Anything which is a doctor is also a person. There exist some surgeons who are doctors. This means that some people are surgeons.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9283054f-e98c-4299-b6e7-8dd6f7a081d5",
        "syllogism": "Every single polygon is a square. No triangles are included in the category of squares. Some triangles are not polygons.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "6f8772d9-64c8-4296-85fb-898046c33a6e",
        "syllogism": "Dogs are in no way cats. There are no cats which are fish. There exist no dogs that are fish.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ef38a966-b81e-4116-82ab-97eb995ca2fe",
        "syllogism": "It is true that every dog is a mammal. Anything that is a dog is an animal. From this, it can be claimed that some animals are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "851af011-a610-4890-bef7-fc9865d28ebe",
        "syllogism": "It is true that every single number is a concept. There are some prime numbers which are not concepts. It must follow that some prime numbers are not numbers.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ebc9f1a5-9193-4a67-b187-2bf5781c3abd",
        "syllogism": "Any animal that is a cat is a mammal. There isn't a single fish that is a cat. This means that no fish is a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "362d75b6-69fd-409f-8b73-fd61a1b208cc",
        "syllogism": "Any animal that is a lion is a carnivore. No gazelle is a carnivore. It is impossible for a gazelle to be a lion.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "87969ab1-7991-427e-be3c-4045e303f301",
        "syllogism": "Every bird in existence is made of glass. There are some robins that are birds. It follows, then, that some robins are made of glass.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "349c7b91-ee3d-4f96-af31-4d00249e65cc",
        "syllogism": "It is the case that no cats are dogs. It is also true that no birds are cats. Thus, it can be concluded that some birds are dogs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "1bfaf1e4-1a78-4bf7-9435-b52586ffbe36",
        "syllogism": "It is not the case that every novel is a short story. Every single thing that is a novel is a book. One can therefore conclude that some books are not short stories.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "f4795f98-61d3-4194-87d9-6aa2ba5e4d92",
        "syllogism": "Every single thing which is a fish is a creature. It is also the case that every single cat is a creature. From this, it follows that all cats are fish.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b39d5a7e-40c0-4236-80d4-24238aa65f8f",
        "syllogism": "It is the case that no cars are bicycles. Every single thing that is a Ferrari is a car. Therefore, some Ferraris are not bicycles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "36bba00b-4596-453f-aa17-dcf20ad0768c",
        "syllogism": "It is the case that every teacher is a college graduate. Some professionals are also known to be college graduates. Thus, it can be concluded that some professionals are also teachers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "eb9ea924-9bf6-46d7-bbad-5cf8d659a05d",
        "syllogism": "Every sparrow is a type of animal. Some sparrows can be described as birds. Therefore, a certain number of birds are animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "d542c648-c8d9-4c3d-bdc4-e42cfe604d37",
        "syllogism": "Not a single person who is a parent is a human. Among the group of people who are parents, some are mothers. From this, we can logically conclude that there are some mothers who are not humans.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "2ae9a652-1291-412b-b435-33983a7f6313",
        "syllogism": "It is not true that any dog is a cat. A certain number of golden retrievers are found to be dogs. Thus, some golden retrievers are not cats.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "25278ae4-b026-4403-bd11-23918d616995",
        "syllogism": "Every single mortal is a number. There are no numbers that can be described as humans. Based on this, some humans are not mortal.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "8549a2e9-abf7-40df-83ef-ab7b3d75829b",
        "syllogism": "It is true that no birds are mammals. There are no bats which are birds. Consequently, some bats are not mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "811914ca-d99d-4e96-b2b6-5d5400211a7f",
        "syllogism": "Any creature that is an animal is a bird. There is not a single bird that is a reptile. This logically means that no reptile is an animal.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0a6a2c61-1d0e-47a6-8faa-5a5086a59dc9",
        "syllogism": "Every single tree is a plant. There exist no stones which are also plants. There is at least one stone which is not a tree.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "b67c4d7c-40e5-41d6-8821-98b427bd94ce",
        "syllogism": "There are no vegetables that are fruits. All apples are fruits. This is why some apples are vegetables.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "da4f979d-1acc-4b60-9c09-f2637309561c",
        "syllogism": "There are no sofas that are furniture. There are no chairs that are furniture. Anything that is a chair is a sofa.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c05e6536-84d3-44c5-a5f3-32d838d2134c",
        "syllogism": "There are some elephants which are mammals. There are some fish which are mammals. This leads to the conclusion that some fish are elephants.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "a6990bc2-71c7-4745-a1b3-959943fad22c",
        "syllogism": "Every person who is a primate is a mammal. All humans are mammals. Consequently, every single human is a primate.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "073d458a-fb37-46f1-9557-dee68b73552f",
        "syllogism": "Not a single square is a circle. The entire set of circles is made up of triangles. A portion of triangles are squares.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "0453793d-3578-490a-a79c-35984eba5964",
        "syllogism": "Any item that is a phone is a plant. There isn't a single plant that is an electronic device. This proves that no electronic device is a phone.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "671be363-8174-498e-959c-5aa930502041",
        "syllogism": "It is true that everything that is an elephant is a mammal. It is also true that no fish are elephants. Thus, it is concluded that no fish are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "5e2a9a8e-9469-4b16-a243-f18f3f159709",
        "syllogism": "It is true that no liquids are solids. There are some gases which are not solids. It follows that all gases are liquids.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "ad6117fb-795b-4d97-80a3-1f17c770ee50",
        "syllogism": "Any and all reptiles are lizards. There are reptiles that are mammals. It must follow that all mammals are lizards.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "581cfd7a-fb09-42f9-8759-d28809d96a4c",
        "syllogism": "Anything that is a plane is a vehicle. There is nothing that is an item of furniture which is a plane. Consequently, no piece of furniture is a vehicle.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "92375de2-c1c8-4b7c-abc6-793165b6b3ea",
        "syllogism": "It is true that any dog is an animal. All pets are animals too. Therefore, some pets are not dogs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "42e667da-e467-4797-a862-23132f3c9dc0",
        "syllogism": "There exist no dogs which are cats. There are some pets which are not dogs. This leads to the conclusion that some pets are cats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "007efb0e-6d0c-40c9-8d96-a25a1fbbbf93",
        "syllogism": "Nothing that is a vehicle is an object with wheels. Every single item that is a car is an object with wheels. This proves that a number of cars are not vehicles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5826f9b5-c6e7-4b2d-834d-de148f9bd15c",
        "syllogism": "A creature that is a reptile is never a mammal. There are no snakes that are reptiles. It is necessarily the case that a snake is never a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "18ca9b49-d0cf-44f4-83bf-eb4739bc9317",
        "syllogism": "Nothing that is a square is a circle. There are some shapes that are circles. It must be the case that every single shape is not a square.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "3210a16c-a687-4030-8697-bb2214492501",
        "syllogism": "No cities are countries. All things that are a city named London are cities. It is necessarily true that some cities named London are not countries.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "0bafb494-84dd-4bab-9e35-4ee2c22d7f73",
        "syllogism": "Any golden retriever is a mammal. It is the case that some golden retrievers are dogs. This means that a few dogs are mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "f829409c-4e08-476e-bc07-864702de5a37",
        "syllogism": "Every single insect is an arthropod. None of the creatures that are arthropods are vertebrates. It follows directly that no vertebrate is an insect.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "74642dd5-9eb6-4a00-a493-4b25f3aac128",
        "syllogism": "There are no creatures that are both humans and organisms. Among the creatures that are babies, some are organisms. From this, we can logically derive that some babies are not humans.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "123bf7d7-01dd-421d-bd85-5af87b2663dd",
        "syllogism": "Anything that is a reptile is also an animal. A portion of animals are lizards. Therefore, some lizards are not reptiles.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "66621d65-5d64-4e5e-90a2-fd1eea48d437",
        "syllogism": "There are no vegetables that are not poisonous. Anything that is a carrot is a vegetable. It follows that a number of carrots are poisonous.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "fca654b0-e91a-4199-9869-8892e450f591",
        "syllogism": "Every triangle is a polygon. All shapes that are squares are polygons. Nothing that is a square is also a triangle.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8ef5d7a4-e986-4fc4-99fa-4c74fc40e7fe",
        "syllogism": "There are no fish which are mammals. No lions are considered fish. Some lions are not mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "bd43b96a-b4cd-4380-af60-6f6052586580",
        "syllogism": "Every single rhino is a mammal. Every single lion is a mammal. It is the case that some lions are not rhinos.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "61f8ac6f-5f91-4904-8e41-22bd80f2b1ae",
        "syllogism": "Anything that is a song is also a composition. No composition is an animal. Thus, we can validly conclude that some animals are not songs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "2bf18e1f-3d35-4725-a6a0-73bcf655c976",
        "syllogism": "The class of birds and the class of cars do not overlap. The entire set of cars is composed of sparrows. It is a logical consequence that some sparrows are not birds.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "c15f8962-f325-45d6-9cc6-c0a25435d4a1",
        "syllogism": "The group of even numbers and the group of animals are mutually exclusive. Any animal is also an odd number. There are some odd numbers that are even numbers.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8158cb68-1891-4050-93f6-d7776e724658",
        "syllogism": "Every single creature that is a canine is a mammal. A portion of canines are dogs. It is therefore the case that some dogs are mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "6b013055-b913-4742-94ab-a9dc40d1881f",
        "syllogism": "Nothing that is a stone is a meat. It is also the case that no fruit is a meat. Therefore, no fruit is a stone.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "c7b40258-763b-4059-8ab3-378b76d6a0a8",
        "syllogism": "There exist some things which are birds that are not animals. Every single thing that is a bird is a mammal. From this, it follows that some mammals are not animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "9b9b24ec-59d6-43ca-8165-0ae4d688cda0",
        "syllogism": "Every dog is a canine. Some canines are terriers. Consequently, every single terrier is a dog.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "6fa051ab-5673-4ce7-8234-3baf75bd1d64",
        "syllogism": "Houses are never schools. A few schools are, in fact, buildings. There exist buildings that are not houses.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "8a2350fa-dd4e-430a-a1f7-3ea99a1d0749",
        "syllogism": "Anything that is an elephant is a mammal. Every whale is also a mammal. From this, it is concluded that no whale is an elephant.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "77d1fbe7-3450-4d5d-92c6-7bf4d02c20ae",
        "syllogism": "Anything that is a vegetable is a plant. There is a subset of plants that are fruits. A number of vegetables are not fruits.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "a907b7ac-65e7-4dbf-83db-21957c0c2a8f",
        "syllogism": "Every sport requires physical activity. There is no such thing as soccer that isn't a sport. At least some soccer is a thing that requires physical activity.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "604c4371-08b2-478a-85a3-273194f6153e",
        "syllogism": "Every single liquid is a fluid. It is impossible for any water to be a fluid. It can be concluded that no water is a liquid.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b289a588-133e-40b7-a1ba-014af94a8522",
        "syllogism": "A few of the buildings are houses. There are no houses that are cars. As a result, some cars are buildings.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b598df99-7a53-4672-adeb-d14c026a9fff",
        "syllogism": "Any structure which is a house is made of chocolate. There are some buildings which are houses. This means that some buildings are made of chocolate.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "78b7fd54-43d6-400c-a28c-efda282272c1",
        "syllogism": "Anything which is a bird is an animal. No birds are rocks. Therefore, It is possible to infer that some rocks are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8bb41f23-ab9f-4ed2-898a-f5c6f2fff389",
        "syllogism": "Anything that is a fruit is a food that contains seeds. Some foods are, without a doubt, fruits. Therefore, every single food contains rocks.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "10c004f6-6468-4756-a2bb-cf97b0f34a89",
        "syllogism": "Every single dog is an animal. Anything that is a cat is an animal. It follows that a few cats are dogs.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "54a39670-9d4d-4f11-bbd9-29c01e27210d",
        "syllogism": "Every single apple is a food. It is also true that every apple is a fruit. This means that all fruits are foods.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "e9e598d7-7e99-486a-bb97-d9291a13ce23",
        "syllogism": "Anything that is a stone is not a berry. Of the items that are fruits, some are not berries. It follows that some fruits are not stones.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8bdb2703-2d29-40a2-9c80-9c4b8385a438",
        "syllogism": "Every single dog is a cloud. All animals are clouds. It must be true that every animal is a dog.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8ef93cb4-e88e-47aa-86a0-2ed732f20a99",
        "syllogism": "Every single dog is a mammal. A portion of mammals can be classified as creatures that bark. Some creatures that can bark are not dogs.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d8794f2a-f535-4be9-a29b-71a98af6bf08",
        "syllogism": "Every sky is a blue thing. There is not a single car that is a sky. It can be concluded that no car is a blue thing.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "52c7696c-f9c1-4611-9300-db39de41cf50",
        "syllogism": "Some penguins are birds. Every bird is an animal. As such, it is necessarily true that some animals are penguins.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "d4f7a83b-5939-4873-9a45-1083a6dc2df6",
        "syllogism": "Every single liquid is solid. It is not true that any rock is a liquid. It is the case that no rock is solid.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "95d56d9f-c7ed-4537-b582-7076beccbd92",
        "syllogism": "There is no celestial body that is a thing in the sky. All planets are things in the sky. The implication is that a number of planets are not celestial bodies.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "d7842911-1759-4c23-836c-3f81f873af73",
        "syllogism": "It is the case that no fruits are vegetables. It is also true that no apples are fruits. From these statements, one can conclude that some apples are not vegetables.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "67c048fb-e79b-4267-b6cc-5605a1b92810",
        "syllogism": "Every single book is a planet. Every single book is furniture. Therefore, there are pieces of furniture that are planets.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "041da415-c737-4996-a959-f1f65fe391db",
        "syllogism": "Every single cat is an animal. Everything that is a dog is an animal. There is at least one dog that is a cat.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b8ec446c-cd3b-48cb-bf36-7c0cb3f026d2",
        "syllogism": "Every single ocean is a body of water. Any area that is a sea is part of an ocean. This means that all seas are bodies of water.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "b97a902a-7e57-4ae9-aaaf-edd77e73fbf6",
        "syllogism": "Every single plant is food. Everything that is a fruit is food. It follows that every fruit is a plant.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b038f6a1-7259-4ddd-b549-c24e7b799cf8",
        "syllogism": "Any animal that is a land animal is not a whale. Some whales are considered animals that live in the ocean. It is the case that some animals living in the ocean are not land animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "903efee0-a3c6-4577-af64-e1589aa528e9",
        "syllogism": "Every single vegetable is not a fruit. A portion of the things that are croissants are fruits. The result of this is that some croissants are vegetables.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6307f80f-af36-4c0e-b69a-714cfd070f21",
        "syllogism": "A few of the insects are beetles. Every beetle is an arthropod. As a result, some arthropods are insects.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "cafd8eaf-668f-4c69-ae03-ec38709e4b9e",
        "syllogism": "Every single human is a cloud. It is also true that every mammal is a cloud. This proves that all mammals are humans.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "481ceb04-c39f-4f7a-b645-18dc5aa717b2",
        "syllogism": "There are no dogs who are cats. A few dogs are pets. This implies that some pets are cats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "0088d914-814d-4abd-8924-b4191edca9b8",
        "syllogism": "Some chairs are people. Every single person is a living being. Consequently, some living beings are chairs.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "10378e06-9ec7-4344-a589-0d1fbbca4396",
        "syllogism": "Every single novel is a planet. No planet is a book. It is a necessary conclusion that no book is a novel.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0d670133-b450-4117-8cee-c7b73af9d8f5",
        "syllogism": "There is nothing that is a planet that is not also a celestial body. It is the case that every celestial body is an object in space. Therefore, some objects in space are planets.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "12946b9f-6889-4906-bf58-81f946d2e823",
        "syllogism": "All fish are animals that live in water. Some sharks are not fish. We can infer that some sharks are not animals that live in water.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "832f59aa-bfee-4e92-b247-d8719f1844ae",
        "syllogism": "Every single dog belongs to the canine family. Anything that is a chihuahua is a dog. This means that every chihuahua is a canine.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "b40039e8-e634-450a-a221-81c77ffb0517",
        "syllogism": "Every single cat is a living creature. Every single dog is a living creature. As such, there are some dogs that are not cats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f4e0bda0-00ec-4938-acd5-21d3cc260e58",
        "syllogism": "Every fish is a creature that is an amphibian. Without exception, all sharks are fish. Therefore, it is certain that every shark is an amphibian.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "cc8ddde6-b7cf-408c-a0a0-92e200117c30",
        "syllogism": "Nothing that is a car is a motorcycle. A few things called vehicles are identified as being cars. This proves that some vehicles are not motorcycles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c11d7833-78e3-45ba-af17-3fdb4217555b",
        "syllogism": "There are no numbers that are tables. It is not true that any table is a couch. It is the case that some couches are numbers.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "32c2f0fa-083f-4f90-b33d-201e95816ea6",
        "syllogism": "Anything that is a vegetable is not a plant. A portion of the things that are vegetables are also carrots. The conclusion that some carrots are not plants is inescapable.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0d98be0f-0057-41ac-bb47-fcdab1a96c6f",
        "syllogism": "Every single bird is a fish. Some penguins, it is known, are not fish. This necessarily implies that some penguins are not birds.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0c5bbda6-c0e7-42ac-943a-b09a2dcea726",
        "syllogism": "Not a single object that is a car is a boat. A group of cars can be described as vehicles. It is a logical consequence that some vehicles are not boats.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "cdf4f5aa-8b47-4edd-9be2-4c9184f7b721",
        "syllogism": "A group of numbers are planets. Every planet is a celestial body. As a result, a portion of celestial bodies are numbers.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ab27dbac-d446-4199-a267-16d010b7588f",
        "syllogism": "There are some mammals which live on land. It is the case that no fish lives on land. Consequently, all fish are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "40b42a57-63c2-4f06-af7e-87b8bdfef9fd",
        "syllogism": "Some liquids are cats. Every single thing that is a cat is a mammal. Therefore, some mammals are liquids.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "30d11495-2d7d-49a1-a542-0ebc22ce160f",
        "syllogism": "Every computer is a plant. There exist some laptops that are not plants. It must be the case that some laptops are not computers.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "e1f5938b-bf0b-4cfe-8b2a-8b83c91dcbb1",
        "syllogism": "Everything that is a spoon is a piece of cutlery. No giraffes can be considered pieces of cutlery. It can be said that some giraffes are not spoons.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "7841eb47-8f72-475c-852d-4d709ae0965e",
        "syllogism": "There are some mammals that are primates. Every single primate is an animal. Consequently, some animals are mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "732e20b3-c504-4115-914d-496d0c4ee6da",
        "syllogism": "Every single mammal is a living thing. The set of animals contains no living things. Not a single mammal is an animal.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "a9a258b5-4403-491d-87a1-707fcb480564",
        "syllogism": "There are no cats which are fish. There are no fish which are animals. It follows that some animals are cats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "1fcd8f80-1760-4051-9181-025b909589cf",
        "syllogism": "There are no fish that are mammals. No cats are considered fish. Some felines are not mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "2d3a1de0-fdb2-45f4-aef8-6f4e3f64f55b",
        "syllogism": "The set of honest people and the set of liars are mutually exclusive. There are no politicians who are liars. All politicians are honest people.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c8a91594-47cb-47e7-829a-a3e094917c92",
        "syllogism": "There are no animals that are flying vehicles and are also canines. All flying vehicles are dogs. It is necessarily true that a portion of dogs is not canines.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "43ae00ee-0cf2-4a62-beab-56f90d170347",
        "syllogism": "There are no squares which are round. There are no circles which are squares. It follows, then, that some circles are square.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c38a9bc0-efdd-49af-af59-17a6567d8817",
        "syllogism": "Every item that is a mammal is an animal. Some lions are mammals. Therefore, all lions can be said to be animals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "df7bae54-40d1-4be5-b827-b4da77465505",
        "syllogism": "It is true that no numbers are waves. No sounds are numbers. It follows that no sounds are waves.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "2b535ac3-2104-4754-b57a-dd89319e6a16",
        "syllogism": "There are no cars that can be called boats. It is also true that every car is a type of vehicle. This has led to the conclusion that a portion of vehicles are cars.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "cd79e6f0-75ac-4c80-b4d2-31711a961bac",
        "syllogism": "Every single cat is an animal. There are some fish which are cats. Fish are in no way animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "61ba9569-1368-4d47-9706-b54a7034bab5",
        "syllogism": "It is true that everything which is a bird is a winged creature. There are no insects which are birds. A conclusion that can be drawn from this is that there are insects which are winged creatures.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fe71763e-e04e-47e9-a49d-6bae7ff6de6f",
        "syllogism": "Anything that is an apple is a cloud. Every single apple is a fruit. It follows from this that all fruits are clouds.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "25f8f3fc-d38a-4b43-9a7a-4324cbc869bc",
        "syllogism": "Nothing that is a pet animal is also a feline. Some cats happen to be pet animals. This leads to the conclusion that a certain number of cats are not felines.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0ed786f8-51d0-40c7-b692-441bc96ec29d",
        "syllogism": "All people who are doctors are those who have medical training. There are no people with medical training who are teachers. This means that no one who is a teacher is a doctor.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "af0270f5-da4b-45f3-8677-9ff69a4c55fa",
        "syllogism": "There are no mammals that are birds. Every single thing that is a mammal is an animal. It is the case that some animals fail to be birds.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "5cb83caf-678a-43b8-a8d7-beedd3b39f55",
        "syllogism": "Some of the felines in the world are lions. Every single feline is a mammal. Consequently, some mammals are found to be lions.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c73d301b-6e16-4a04-8f5d-13c379e2ec3d",
        "syllogism": "Absolutely no primary color is also a secondary color. Some things which are visible colors are classified as primary colors. It is thus the case that not every visible color is a secondary color.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "8c835a2b-e7f5-4be2-a3f2-f249660ec877",
        "syllogism": "There are some things which are clouds that are not made of water. Every single cloud is made of vapour. It follows from this that there exist some things made of vapour that are not made of water.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "70ae91e5-486a-46d0-8c37-66d67c1b5e18",
        "syllogism": "The category of fish is a subset of the category of animals. All animals that are dogs are also animals. Nothing that is a dog is a fish.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "bd80aa79-4ef9-4adb-bb86-2fe99e5e0445",
        "syllogism": "Something that is a living organism is a mammal. The entire set of people is composed of living organisms. It is the case that all people are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "49ece5f3-1a1b-48e2-b806-2a0c711e4721",
        "syllogism": "Every single laptop is a computer. There are some abacuses which are not computers. This leads to the conclusion that some abacuses are not laptops.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9d42d0c9-9b18-4bb9-9a6c-3917d7f8dbbe",
        "syllogism": "Among dogs, there are some that are carnivores. All dogs belong to the class of mammals. Consequently, among the class of mammals, some are carnivores.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "eba06587-ca00-480c-ae24-0330858b5584",
        "syllogism": "Every single feline is a mammal. Anything that is a cat is a feline. At least one cat is a mammal.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "3adadf58-1822-4358-a40b-b7c4ca7f9afa",
        "syllogism": "There is no overlap between the category of vegetables and the category of fruits. Anything that is an apple is, by definition, a fruit. Apples and vegetables are two separate categories.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a91b60be-febd-4dc5-900e-969c31eba6ae",
        "syllogism": "Every single thing which is a dog is an animal. Some cats are not dogs. We can infer that some cats are not animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "1ce77016-2e3d-431a-af11-e015722c98fe",
        "syllogism": "Anything that is a tree is made of wood. Every single chair is made of wood. It is necessarily concluded that every chair is a tree.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "1a6a9f12-15dc-467c-8311-2ee796d95c22",
        "syllogism": "There are no dogs that are cats. It is the case that no cat is a fish. Therefore, it is possible to conclude that some fish are not dogs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "91e3ba86-4129-4142-8e1d-89a43c8a7246",
        "syllogism": "There are no birds that can be called fish. It is also true that every bird is a type of animal. This has led to the conclusion that a portion of animals are birds.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "9372c576-58df-4872-8663-2e6c8b210274",
        "syllogism": "Everything that is a human is also a primate. Everything that is a human is also a bipedal animal. Consequently, some bipedal animals are primates.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "3f047c98-7589-4e41-8055-1f023c4d9707",
        "syllogism": "There are no footwear items that are clothing. Every shoe is a type of footwear. It can be concluded that no shoe is clothing.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "60f556a7-b0c7-4bde-82ce-e49b1cf72ec5",
        "syllogism": "Spiders cannot be arachnids. It is a fact that all tarantulas are spiders. It must be concluded that some tarantulas are not arachnids.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "27f93d6e-ae4d-46da-9235-7c900780b18c",
        "syllogism": "There are no cats that are also dogs. It is known that there are no dogs that are birds. One might conclude that no birds are cats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "172f9030-2726-49a1-8acf-40c8d9661aab",
        "syllogism": "Any object that is a shape is an animal. There are no circles that are also animals. A portion of shapes are not circles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "013da35a-1a78-4298-9660-495f8e0c9530",
        "syllogism": "There exist some things which are water which are not liquids. All water can be poured. It follows that some things that can be poured are not liquids.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "9207083f-0077-4ac2-a8c1-be3e589f559e",
        "syllogism": "There are no squares which are circles. All squares are, in fact, shapes. It's the case that some shapes are not circles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "04ef6520-e8a0-4f08-a903-44fd4902ec3f",
        "syllogism": "There is no automobile that can be classified as a bicycle. Every single car is an automobile. This means that no car can be a bicycle.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "499ba307-8c1b-4244-9a41-15129f3f000e",
        "syllogism": "It is not the case that every single person has blood. Every person is a mammal. One can therefore conclude that some mammals do not have blood.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "7a74a7dc-cc6f-4f5e-95fa-5bd9528c9d8d",
        "syllogism": "There are no insects that are animals. Every single ant is an insect. Consequently, nothing that is an ant is an animal.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "45d795eb-780a-4694-bf87-6819b272cd49",
        "syllogism": "Anything that is a teacher is an educator. Every single person who is a student is also an educator. It logically follows that there are some students who are not teachers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "aea757a2-6727-4816-bcb7-1f0bdad9e4cc",
        "syllogism": "There exist certain creatures that are mammals, yet they are not reptiles. Every creature that is a mammal is also considered an animal. From these statements, it follows that some animals are not reptiles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "84d6b2e4-f71e-45eb-9647-acf23c90a863",
        "syllogism": "There exist some fish that are mammals. A few elephants are mammals. Consequently, some elephants are fish.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "95637ce9-5489-45cb-aa6c-73934ab7e489",
        "syllogism": "Every single dog is an animal. Everything that is an animal is a mammal. It must therefore be true that every mammal is an animal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "a23659e2-d0fc-4b82-b5a5-a526c9c22dda",
        "syllogism": "The category of non-living things and the category of computers have no members in common. At least one human is a computer. At least one human is a non-living thing.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "371da820-c909-468d-a7d8-333db7019688",
        "syllogism": "It is the case that no two-wheeled item is a vehicle. A certain number of bicycles can be found among two-wheeled items. Therefore, a number of bicycles do not belong to the category of vehicles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "e79947da-dcf7-459b-8d64-417bd24ace94",
        "syllogism": "Not a single motorized vehicle is a bicycle. It is also true that no motorized vehicle is a car. It follows that no car is a bicycle.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "940e3b1d-dd3d-4119-a379-178a8b6f8397",
        "syllogism": "Every single mammal is an insect. There are no insects which are dogs. Based on this, it must be the case that some dogs are not mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "9898c43c-c5d9-4c03-aa4f-46e30e136037",
        "syllogism": "There are no fruits that are things that grow on trees. Every single apple is a thing that grows on a tree. Consequently, it can be said that some apples are not fruits.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "92a2576e-da7a-4853-90a3-9f9171a6ed51",
        "syllogism": "It is true that every reptile has fur. Some snakes are known to be reptiles. Therefore, we can conclude that some snakes have fur.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a7504ed6-5b8e-42d0-bb8b-11754ac5953a",
        "syllogism": "Every single person who is a professor is an academic. Any academic is a knowledgeable person. Therefore, some knowledgeable people are professors.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "894cbefc-041e-4078-8175-4d5a1b60b171",
        "syllogism": "Every single living being is a cloud. It is true that every bird is a cloud. It follows that no bird is a living being.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "ddb9db4b-c186-4ee3-a305-7fcf317b255d",
        "syllogism": "There are all men that are humans. Every single man is a mortal. As a result, all mortals are humans.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "50d3b41d-0d2b-49ec-8d6e-1c012d831aab",
        "syllogism": "There exist some things which are trees that are not pines. Everything that is a tree is a plant. It logically follows that there are some plants that are not pines.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "d8e827ad-b91a-45a7-8d28-7527f8b59d1d",
        "syllogism": "Nothing that is a plant is a mammal. A portion of trees are to be found among the plants. Thus, there are no trees that are also mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "e3e1b6fb-ddf8-452d-8990-3efd9f006a28",
        "syllogism": "Anything that is a square is also a quadrilateral. A triangle can never be a quadrilateral. It is the case that no triangle is a square.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "4ec66db0-ee0c-4ed9-ac5e-e7f8a3f6d1dd",
        "syllogism": "Every single thing that is a dog is a mammal. Every mammal is an animal. From this, it follows that some animals are indeed dogs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "67821bb9-63a7-4517-a335-8cd6d735ad81",
        "syllogism": "Anything that is a car is not an airplane. There are no vehicles that are cars. Consequently, every vehicle is an airplane.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d518fc34-889a-45f9-92e8-f50d237731ad",
        "syllogism": "There are some fish that are salmon that live in fresh water. All salmon are fish. Therefore, some fish are fresh water fish.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "788c386f-8839-45b5-9c62-98c2334673e7",
        "syllogism": "Anyone who is a teacher is an educator. Nothing that is a principal is a teacher. Consequently, some principal is an educator.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "56dea4d9-94ad-4daf-893b-945bfe93bb7b",
        "syllogism": "There are no chairs that can be considered musical instruments. Certain chairs exist that are also antiques. The conclusion that a portion of antiques are not musical instruments is inescapable.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "164f7e16-7ac9-4774-a7c7-c2cbef298b62",
        "syllogism": "Every single cat is a type of animal. A few cats are mammals. It must follow that a portion of mammals are animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "6dc080d8-0813-4880-bd7e-3d1045a738b4",
        "syllogism": "It is true that everything which is a elephant is a mammal. There are no things that are wolves that are also elephants. From this, it follows that there are no wolves which are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "3ced0425-c600-49d7-a41e-a958eea666d2",
        "syllogism": "Not a single one of the things that are penguins is a flying bird. It is known that some birds are flying birds. The conclusion is that some birds are not penguins.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "7249592f-7e6a-4976-9b19-10241d09dc6b",
        "syllogism": "There is no snake which is a mammal. It is true that every single mammal is a reptile. It follows from this that all reptiles are snakes.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "5f809928-5ead-4ebc-8fb0-c9eb220743f0",
        "syllogism": "Every single human is a mammal. A subset of mammals is composed of women. It is necessarily true that some women are not humans.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "5e7507ca-56d4-4de4-907f-8f0b1e17ac18",
        "syllogism": "Anything that is a bird is a mammal. No parrots are included in the category of mammals. It is the case that some parrots are not birds.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "002a6051-f7b3-4040-b571-50cfea46aaff",
        "syllogism": "Every item that is a rose is also a flower. Every item that is a rose is also a plant with thorns. Hence, some plants that have thorns are flowers.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c86fa01b-37ba-42be-9d5a-6de70b504e54",
        "syllogism": "There is no man that is a cat. No cat is a woman whatsoever. This implies that all women are men.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "267512dd-01fb-4729-b167-a9df3f430683",
        "syllogism": "Every single animal that is a cat is a vertebrate. Some fish are classified as vertebrates. As a result, not all fish are cats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "db2abe54-05ba-4564-bb8b-6ccace6583d3",
        "syllogism": "Every item that is a fish is a plant. Some cars are fish. Therefore, all cars can be said to be plants.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d7f88cf8-7e75-4e88-a1e5-4f8ee0f7df4f",
        "syllogism": "It is true that every human being is a vegetable. There are no vegetables that can be classified as teachers. As a result, it must be that some teachers are not people.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "44dc4bd3-0d89-4d86-94f8-775692c4125c",
        "syllogism": "Every nurse is a healthcare professional. Not a single teacher is a healthcare professional. A part of the population of teachers are not nurses.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "0ca27016-be9b-4156-9e2a-509010ee8b89",
        "syllogism": "Drums are completely separate from trumpets. A trumpet is, without exception, a musical instrument. Some musical instruments cannot be classified as drums.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "ab8d4f5a-c4f4-4d1d-afea-b973c560be29",
        "syllogism": "There are no creatures that are both mammals and reptiles. The class of human beings has members that are reptiles. The consequence is that some human beings are not mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "388a5385-6f40-43a8-b439-31f7de303b45",
        "syllogism": "Anyone who is a teacher is an educator. It is impossible for a student to be an educator. Consequently, every student is a teacher.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "fb36a074-649e-4d1c-99c0-9ee82e69775f",
        "syllogism": "It is the case that no liquid is a solid. It is also the case that no gas is a solid. Therefore, all gases are liquids.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "def100cc-5fa6-4026-bf80-73c1534c3728",
        "syllogism": "Every fish can be seen to write novels. Anything that can write novels has feathers. It follows that a few things with feathers are fish.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "98fda6b1-7e7b-48ea-9307-e27dfba67bb2",
        "syllogism": "Every dog is an animal. There are no felines that are canines. It is the case that no cat is a dog.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "0b639393-0cbf-4162-90a6-80cd8a7dc982",
        "syllogism": "Anything which is a mammal is cold-blooded. All things that are whales are mammals. There exists at least one whale that is cold-blooded.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "65473904-b2b6-44f0-83c3-66265f64d972",
        "syllogism": "A number of objects categorized as furniture are not chairs. Every single item of furniture is a household good. We can therefore deduce that some household goods are not chairs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "0b8e8e21-cd62-4650-8381-d0502187cab3",
        "syllogism": "There exist some buildings who are also houses. Of the things that are homes, some are also houses. It must be the case that some homes are not buildings.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6482e79d-72f3-4f68-9f0b-756c4324cf4a",
        "syllogism": "Anything that is a mammal is a living organism. Every single dog is an living organism. This means every dog is a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "78e5d104-977c-4233-94ac-519017f63a3b",
        "syllogism": "There is no animal that is a living creature. There are no things with wings that are living creatures. It can be deduced that there are no things with wings that are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d109b3fe-c6b0-401b-b185-250fa2af3ef7",
        "syllogism": "There is no item that is a vehicle which is also a car. The group of automobiles includes some that are cars. We must accept that some automobiles are not vehicles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f21a4aa3-4c4f-4f0c-a5be-28553f28a383",
        "syllogism": "All things that are cars are vehicles. There is no vehicle that is a bicycle. Therefore, there is no bicycle that is a car.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "82567966-505e-45fe-a4b0-c34de685c0a7",
        "syllogism": "Every single dog is a mammal. A small number of mammals are animals. Some animals are not dogs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "dc67f615-0f81-4c0b-8870-1a0a7d995ab6",
        "syllogism": "Anything that is a bird is a vertebrate. There are no insects which are birds. Therefore, it can be concluded that no insects are vertebrates.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "d7ff6706-7df0-4f45-98ff-54593558d4ee",
        "syllogism": "It is true that no car is a boat. There are no airplanes that are boats. Therefore, it is a fact that some airplanes are cars.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "7b5fba34-77db-4a14-a9f4-810833a4d47b",
        "syllogism": "Zebras are in no way dogs. There are some dogs that are mammals. This implies that some zebras are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "bc22f637-3a98-4ae4-bb0f-26189c876e78",
        "syllogism": "There are no humans that are animals. Every single doctor is not a human. Therefore, we can deduce that no doctors are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "5631278b-7761-4a8c-ae61-1694dd27d01a",
        "syllogism": "Every person who is a prime minister is a politician. There are a number of people who are celebrities who are also politicians. It follows from this that there are some celebrities who are prime ministers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ff71268e-b08f-48c4-a612-460a70e936ec",
        "syllogism": "Anything which is a cloud is made of rock. Some weather phenomena are known to be clouds. Consequently, some weather phenomena are made of rock.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "e2672031-d897-486a-adc7-82ce6404a832",
        "syllogism": "There are no computers that are animals. There are no animals that are trees. Therefore, some trees are computers.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b9cd6b85-d8d8-4cf0-98e0-5a436b58820a",
        "syllogism": "All people from New York need to pay taxes. Every New Yorker is a citizen of the US. Therefore, all citizens of the US need to pay taxes.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "9f914ab3-38b2-420a-a2f6-fcf43f939219",
        "syllogism": "Anything that is a mammal is warm-blooded. Every single dog is a mammal. At least one dog is warm-blooded.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "de7fde47-808e-40d6-9096-51fc9478b3e6",
        "syllogism": "There are some animals that are sparrows. All things that are sparrows are birds. Consequently, every single thing that is a bird is an animal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8ea7335f-a484-4c94-b951-36f19e074fc5",
        "syllogism": "There are no flowers that are vegetables. There are some carrots that are vegetables. As a result, no carrots are flowers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "febb0646-5f5b-4cee-bc66-a3444c562560",
        "syllogism": "There is no person who is both a musician and a non-artistic person. It is known that some human beings are among the non-artistic people. The consequence is that there exist human beings who are not musicians.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "4f6235d2-3f86-4257-908e-212e5e216d2e",
        "syllogism": "It is the case that everything which is a dog is a mammal. No building is a dog. As a result, no building is a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "a42796dd-7101-4b03-9025-ed548108bb4d",
        "syllogism": "Not a single dog is a canine. Every single poodle is a canine. It follows from this that there are a number of poodles who are not dogs.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "286eaae9-9661-46d3-9bce-ad2ccd9ec762",
        "syllogism": "Anything that is a bird is a flying creature. Every single thing that is a bat is a flying creature. This means that every single bat is a bird.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "53a60516-2faa-44ff-bf3b-bafc0c977589",
        "syllogism": "There is no table that is a desk. No desks are chairs whatsoever. Therefore, we can conclude that no chair is a table.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "6fd2b434-4215-415b-9e9b-5cf25fdc219f",
        "syllogism": "Anything that is an insect has six legs. Every single spider is an insect. There are no spiders that do not have six legs.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c59a7a28-08ea-4b9f-9c08-9620ad08c302",
        "syllogism": "Every single cat is a dog. It is true that no dog is a feline. It must follow that no feline is a cat.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "318c3850-46c9-4bc9-b5e9-cf6b80f593dd",
        "syllogism": "There are no fish that are mammals. There are no fish that are birds. Consequently, no birds are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "5176c307-a806-4e4e-9298-5d6a45abe380",
        "syllogism": "There are no fish that are land animals. It is true that all fish are vertebrates. It is the case that some vertebrates are not land animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "29250e54-2aae-4cb6-a6d3-f2b461c30e62",
        "syllogism": "Every single item that is money is not currency. A subset of items that are dollars are currency. It follows that some dollars are not money.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f78276e5-b847-4878-aba1-f920d12288f4",
        "syllogism": "Everything that is a poodle is a dog. It is known that a portion of poodles are dogs. Consequently, some poodles are not dogs.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "1230d4f7-42c5-4131-bbf3-5fe5387c93ea",
        "syllogism": "There are no tables that are chairs. All zebras are, without exception, chairs. It is therefore suggested that some zebras are tables.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "338b8556-2613-4481-a5d3-01653a6d9e69",
        "syllogism": "There are certain leaders who are politicians. All of those who are politicians are also human beings. Hence, a group of human beings are leaders.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "17e81c6e-6a6e-453a-aabf-99a82ee26f26",
        "syllogism": "There are no reptiles which are also mammals. Not a single amphibian is a reptile. It is the case that a portion of amphibians are not mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8fdb598b-6ead-4c42-8de3-b075661b2942",
        "syllogism": "Everything that is a pencil is a writing instrument. Nothing that is an eraser is a writing instrument. There exists at least one eraser which is not a pencil.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a943b701-942e-4df8-bb91-4cee9349502a",
        "syllogism": "Some plants are a type of vegetable. There are some carrots that are vegetables. This leads to the conclusion that some carrots are plants.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "4843f8dc-ce23-4871-924d-f7f8c0fdc05a",
        "syllogism": "Every single thing that is a car is a vehicle. A portion of trucks are vehicles. Consequently, some trucks are not cars.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "60e5025b-d3b4-4b3c-a306-6486cd5a5f22",
        "syllogism": "Anything that is a square is also a polygon. It is known that there are no circles that are squares. It has been proposed that no circles are polygons.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ed17a05a-a553-4df8-a45b-384eadb243e1",
        "syllogism": "There are no cars that are made of water. There are no cars that are clouds. Consequently, no clouds are made of water.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c6aae9b7-d793-4aa7-a0cd-b1d9aed1b06b",
        "syllogism": "A few cars are trucks. Every single thing that is a truck has wheels. It follows from this that every single thing with wheels is a car.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "105da322-1326-48c0-8e48-6d74d8411eb9",
        "syllogism": "There are no mammals which are fish. Every single fish is an animal. One can conclude that some animals are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "cb4e2e4c-9882-43d9-8109-e4f96bbd15c1",
        "syllogism": "Animals are entirely separate from creatures with beaks and feathers. Every single animal that is a bird is a creature with a beak and feathers. Birds cannot be considered animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f31cf4aa-e20f-4e2b-8bf0-18cc0c5ad48b",
        "syllogism": "It is true that no lion is an animal. A certain number of lions are carnivores. Based on this, it must be the case that a certain number of carnivores are not animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "58b506bc-66d0-4871-b98a-265bcf54830f",
        "syllogism": "Birds are in no way winged creatures. There exist no winged creatures that are animals. It is the case that no bird is an animal.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "ac5ce699-15c3-4842-8f1e-7d70227b0787",
        "syllogism": "A portion of buildings are dogs. Every single dog is a domestic animal. Hence, some domestic animals are buildings.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "688d3214-2f0e-4f44-b6ad-e92a7fa5a462",
        "syllogism": "Every single lion is a building. There is no lion which is a skyscraper. Therefore, there are no skyscrapers that are buildings.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "38e06b78-6374-4cb0-8ba9-a177a7b62c31",
        "syllogism": "All things which are triangles are polygons. All things which are triangles are geometric shapes. It follows that some geometric shapes are polygons.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1dad7389-e8ab-4962-8d10-83b42c2fa4fe",
        "syllogism": "Every single banana is a type of fruit. There are no fruits that are rocks. Therefore, it necessarily follows that some of the objects that are rocks are not bananas.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "8c136b17-300a-4f32-85bb-6853fcdd0a01",
        "syllogism": "There are some cars that are not a liquid. There are no bicycles that are cars. Consequently, there are no bicycles which are liquid.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "82c35dfc-be1a-4fff-aaa9-454da55392ae",
        "syllogism": "Every single flower is a plant. Any and all roses are also plants. This implies that all roses are flowers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ec7a26c0-9309-4abc-9e9a-c1d472b2260c",
        "syllogism": "It is the case that no numbers are concepts. Everything that is an integer is a number. Consequently, it must be true that some integers are not concepts.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5f1077d7-b61a-47a2-82ba-edae062acd77",
        "syllogism": "Anything which is a rock is heavy. It is the case that some heavy things are not clouds. Therefore, this implies that all clouds are rocks.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "99ba63a6-3b6a-4f63-a0f7-6cef1c11818f",
        "syllogism": "Everything that is a hut is a vehicle. A few huts are houses. Thus, a number of houses are vehicles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b3ea77c5-3d0e-4d54-9a4d-115a8d0ddd2e",
        "syllogism": "Anything which is an ocean is a desert. There are no Atlantic Oceans that are not oceans. There exists at least one Atlantic Ocean that is a desert.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "442ed46c-5aa5-445f-9ac3-4bf910bc7b3a",
        "syllogism": "Anything that is a unit of time is a liquid. No weeks can be called liquids. A portion of weeks are not units of time.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "c85824aa-aa42-497f-8997-ed7e9aa3b2f2",
        "syllogism": "Every single cat is a dog. There is not a single mammal that is a cat. It can be concluded that no mammal is a dog.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "7f71a082-108e-4c3c-a1ad-1af6c5bc3088",
        "syllogism": "It is true that some people who are students are human. There are teenagers that are also students. This proves that a number of humans are not teenagers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "d6419856-fddb-4f1b-b11a-9121c08dd577",
        "syllogism": "It is true that anything that is a rose is a flower. Every single flower is a plant. Therefore, it is a fact that some plants are roses.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c79f942d-c2a0-48d1-91d2-678a3fd36186",
        "syllogism": "Anyone who is a planet is round. Some balls are not round. It is thus the case that all balls are planets.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c5035d70-ed49-4e5f-b18b-611693942991",
        "syllogism": "It is the case that every fish lives in a tree. There exist some sea basses which do not live in trees. It necessarily follows that some sea basses are not fish.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "435fcf21-2212-486d-86b2-92fe61151294",
        "syllogism": "There are no mammals which are reptiles. Some animals are mammals. From this, it can be concluded that some animals are reptiles.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "7c1ad437-c35c-456c-a34c-087eec67ee7a",
        "syllogism": "There is no overlap between even numbers and words. All words are numbers that can be divided by two. Therefore, some numbers divisible by two are not even.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f5cb79a6-006c-4630-a820-e5b7cf16671d",
        "syllogism": "It is a fact that all shirts are garments. Every single garment is an article of clothing. Therefore, we can conclude that a few articles of clothing are shirts.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "2390b1c3-032f-44a1-a8ad-6515fa87aaf5",
        "syllogism": "There are no dogs that are felines. It is also true that no cats are canines. Therefore, it is argued that there are no cats which are dogs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "7ff44cd7-5970-4c43-ac34-920d4f533b1f",
        "syllogism": "All hammers are objects made by humans. All tools are also objects made by humans. Therefore, all tools are hammers.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "7d017cf6-f94b-41d9-a6d6-a7bb8767f430",
        "syllogism": "Some of the bees that exist are insects. Every single bee is an arthropod. Thus, some arthropods are insects.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "da3044ed-e1a7-40a7-8bd2-cdeb09f5dbdb",
        "syllogism": "No animal that is an invertebrate is a vertebrate. Among the things that are spiders, a few are invertebrates. Thus, some spiders are vertebrates.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "7a442090-27f1-4565-b453-2183e6a605ea",
        "syllogism": "Every single doctor is a professional. Anything that is an engineer is also a professional. Some engineers fail to be doctors.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "bdb97c21-a08a-4fe1-b156-292e216a75ef",
        "syllogism": "It is true that no comet is a moon. It is a fact that no planet is a moon. Therefore, some planets are comets.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c0895494-c8b9-49b8-ae50-85e05a9c2bad",
        "syllogism": "Cats are in no way mammals. Every single cat is a feline. It is the case that some felines fail to be mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "55f37da9-53b1-41bd-8f9c-59909de052fd",
        "syllogism": "Every single chef is a culinary expert. No pilots are included in the category of culinary experts. A certain number of pilots are not chefs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "b0c77d6f-3671-41cc-a15a-b980c56044fb",
        "syllogism": "Students are in no way teachers. There are no teachers who are learners. It is the case that no student is an learner.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d8f5c7fb-a431-4ab6-890a-c4122be4c314",
        "syllogism": "There are no plants that can be called humans. It is also true that every plant is a type of vegetable. This has led to the conclusion that every vegetable is a human.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8fc55b1f-be82-47a2-b48a-7ee31ee1c000",
        "syllogism": "The class of athletes and the class of non-runners have elements in common. Every single runner is an athlete. Consequently, a portion of non-runners are not athletes.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "6bb8be4b-69eb-4f96-8612-09547807c00b",
        "syllogism": "Anything that is a cat is a creature with three eyes. Every single kitten is a cat. This means that every kitten has three eyes.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "264785f1-ad8f-422d-ba64-9b9f60adffcc",
        "syllogism": "Everything that is a living thing is a creature. It is impossible for something to be an organism and a creature at the same time. It is the case that a portion of organisms are not living things.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "7083216a-6754-498f-8a93-53d551efe0c7",
        "syllogism": "There is no soda that is a juice. A portion of the items that are beverages are not juices. It follows that some beverages are not sodas.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "3b7c4fd5-632a-4a84-b2c2-482b84cf6f45",
        "syllogism": "There is nothing that is a vegetable that is also a fruit. Every single thing that is a carrot is a vegetable. As a result, at least one thing that is a carrot is not a fruit.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "38d3e6e5-e550-4d91-8d3c-c79d2f803f12",
        "syllogism": "There are no books that are fiction and also non-fiction. Every single fiction book is a story. It follows that some stories fail to be non-fiction.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "b06dffbf-bd41-46ca-84ed-7433e3acd848",
        "syllogism": "Every single priest is a man. All priests are human. It follows from this that some humans are not men.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fd57b6c3-2eb7-4c4d-a7fd-7067584e69bc",
        "syllogism": "There are no cars that are liquids. There are no cars that are oceans. Consequently, no oceans are liquids.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c50941bc-7c9e-43cb-90bd-d5289a7b7f5b",
        "syllogism": "Anything that is a dog is also an animal. There are no animals which are lizards. This necessitates that no lizard is a dog.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "eb04a408-b062-4c93-ba18-ffc28e0e8e4d",
        "syllogism": "Not a single liquid is a solid. There are no gases which are also liquids. It follows that some gases are solids.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f351b1ff-84fb-47d7-9035-e009d5d5a987",
        "syllogism": "Any penguin is a living creature. There are some living creatures that are not birds. It follows that some birds are not penguins.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "c0c3e36b-70c0-4cc8-b13d-3ae4ba0424b8",
        "syllogism": "It is true that all roses are flowers. It is also true that some plants are flowers. One can therefore conclude that some plants are roses.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "e12158a1-5a17-43f2-b721-5790f55a7b89",
        "syllogism": "All of the things that are planets are animals. All of the things that are bridges are animals. It can be deduced that there are bridges that are planets.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "e11356eb-8b5e-43cf-9a95-539dd813e106",
        "syllogism": "All items that are phones are electronic devices. None of the electronic devices are foods. Therefore, no food is a phone.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "5a021fdb-c72e-4a97-b112-a4a4011dee86",
        "syllogism": "No pet is a canine. It is known that a portion of dogs are pets. Therefore, some dogs do not belong to the group of canines.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "367fccf2-1e41-4ca2-88b0-e3b9890c549d",
        "syllogism": "There are no trees that are human beings. Every single oak is a tree. It's the case that some oaks are human beings.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6a1a94e0-943a-400b-a1d9-3d5810d3f215",
        "syllogism": "No circle is a square. No square is a triangle either. Therefore, all triangles must be circles.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f3380f24-0f41-4d1f-a641-cbb86e5b8b08",
        "syllogism": "There are no scientists that are authors of fantasy novels. All fantasy novelists are authors of fantasy novels. This proves that some fantasy novelists are not scientists.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "2b14c9c4-7150-4fcc-afdf-274eefa46c96",
        "syllogism": "No spoons are forks. All things that are ladles are spoons. Therefore, some things that are ladles are not forks.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a2832fb1-b2b4-46e1-9a7c-59c426c6e84f",
        "syllogism": "Every single eagle is a bird. Nothing that is a bat is a bird. From this, it can be concluded that no bat is an eagle.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e7ceac1a-9b69-4033-b75a-7784340595b6",
        "syllogism": "There are no dogs that are felines. Every single cat is a feline. Consequently, there are some cats who are not dogs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "31e903dc-43a9-4fb6-8841-5a724bdf53ca",
        "syllogism": "Every single animal is a living thing. Anything that is a bird is an animal. All birds are living things.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "82fcecfd-04c6-4a02-a513-0b7ed47b9e1d",
        "syllogism": "It is the case that no bird is a fish. Some aquatic animals are things that are birds. Thus, some aquatic animals are things that are fish.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "4b3cd5b6-0e44-4c83-a3ef-3fecca0982a8",
        "syllogism": "It is a certainty that every single doctor is a human being. It is also true that a few professionals are human beings. On this basis, it has been stated that a few professionals are doctors.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "425e7e61-535a-4719-bf90-fc33991b40ba",
        "syllogism": "Anything that is a dog is a mammal. There are no sharks which are also dogs. It is the case that some sharks are not mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "7747bb27-234e-4882-b1cd-ddaebfec1203",
        "syllogism": "Every single mountain is a landform that is flat. Anything that is a hill is a mountain. Therefore, it must be the case that all hills are flat.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "fe6f084b-7a46-4d5f-a2f9-5f0e80774da8",
        "syllogism": "Everything that is a tulip is a flower. It is the case that some trees are not flowers. This necessarily means that some trees are not tulips.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "f7af5fc9-8a51-4ef4-8d9a-67efc9ec9208",
        "syllogism": "Everything that is a vehicle is something that can fly. Any and all birds are things that can fly. This implies that all birds are vehicles.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "759f4e1f-e7b9-4d07-aefb-e62155c300d3",
        "syllogism": "There are some voters who are citizens. Not a single foreigner is a citizen. Therefore, no foreigner is a voter.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "176e3ca1-2c5c-4500-8b42-792ce58d4098",
        "syllogism": "Everything that is a fish is also an insect. Everything that is a fish is also made of fire. Hence, some things that are made of fire are insects.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b3396042-e3fe-4bcb-9cc3-0281c8e0a856",
        "syllogism": "All things that are tigers are felines. All tigers are mammals. Therefore, some animals that are mammals are not felines.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "3f9d3a77-23b4-4ea3-8246-5d39dc5f6d49",
        "syllogism": "Everything that is a carrot is also a vegetable. Some dogs are carrots. Therefore, all dogs can be said to be vegetables.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "906d3863-253f-4a03-9396-aa6ac915b954",
        "syllogism": "There is not a single engineer who is a medical practitioner. Every single person who is a doctor is also a medical practitioner. Doctors and engineers are mutually exclusive occupations.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "de23d5a3-4fb9-46cc-84d8-e0cff6132ab1",
        "syllogism": "It is true that some vehicles are machines. It is also true that no spoons are vehicles. Thus, it is concluded that no spoons are machines.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "154d3137-be50-4fff-85ad-80f687f7806a",
        "syllogism": "There are no rivers that are oceans. Every single river is a body of water. It logically follows that some bodies of water are not oceans.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e3ef3dd1-8520-4e8f-b3e0-e12fde645d76",
        "syllogism": "Every politician is a citizen. All senators are citizens. Consequently, every single senator is a politician.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f859c7bc-5b00-483b-8ca7-5ca519182fe7",
        "syllogism": "There are no cars which are motorcycles. Every single car is, in fact, a vehicle. It is the case that some vehicles are not motorcycles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "19d18525-ca90-4aef-b6d0-3b8a0e15430e",
        "syllogism": "Every single piece of furniture is sentient. It is true that some chairs are furniture. Therefore, every chair is sentient.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "473c1a59-2fbf-498c-b237-ac7513a2901d",
        "syllogism": "There is no triangle that is a square. A square, every single one of them, is a geometric shape. Certain geometric shapes are not triangles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "0b232bb6-4474-4e36-b13e-e6e8bbf83663",
        "syllogism": "There are some researchers who are also academics. A person who is an academic is also part of the university faculty. Therefore, some university faculty are researchers.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "550d9d17-634f-43b0-a389-f8faaead4a7a",
        "syllogism": "It is the case that there are no fish that are also mammals. Anything that is a whale is not a fish. It follows that some whales are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "a37f602d-1c58-42da-bff0-9886d5b37547",
        "syllogism": "Anything that is a mammal is a warm-blooded animal. There is no such thing as a warm-blooded animal that is a fish. It follows that there are no fish that are mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "89cab2a7-6be0-43c5-9000-d6e5160a2ede",
        "syllogism": "Every vehicle that is a car is also a vehicle. A portion of the items that are automobiles are also vehicles. It follows that some automobiles are not cars.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b57336bd-25d5-4f2a-8edc-ecc25544f64c",
        "syllogism": "There are no items that are both felines and cats. The category of tigers contains some members that are cats. It must be the case that some tigers are not felines.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "9f14cb82-d768-436a-93b3-21de7617dc83",
        "syllogism": "Anyone who is a professor is an academic. Not a single artist is an academic. Consequently, no artist is a professor.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "5704ad50-0947-41ed-b7bb-385a2dc1cb52",
        "syllogism": "There are all humans which are primates. Every human is a kind of mammal. It follows that all mammals are not primates.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fcd92fbd-f6f8-4dee-92ae-36de10989e23",
        "syllogism": "Every single thing that is a tool is an object. Anything that is a hammer is a tool. This means that all hammers are objects.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "30b17729-94b7-43d6-973f-c3ed42b6e924",
        "syllogism": "Everything that is a chair is furniture. Every single table is furniture. It follows from this that some tables are chairs.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "666ff1f1-6234-4cce-be59-4b760b692996",
        "syllogism": "The set of planets and the set of clouds are mutually exclusive. All clouds in existence are Earth. A portion of Earth is not a planet.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "99e780ef-b889-4429-a5fe-22a193b9681e",
        "syllogism": "Every single geometric figure is an emotion. It is not the case that some circles are emotions. Therefore, it is possible to conclude that some circles are not geometric figures.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "bab90238-8b28-4f96-b4a1-d60539f830cb",
        "syllogism": "Every bicycle is a vehicle. Every bicycle is an item that has wheels. Therefore, this implies that some items with wheels are vehicles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "54cf0041-6930-4de3-aac5-4810959586d0",
        "syllogism": "It is a fact that all birds can fly. There are some animals which are birds. Therefore, every single animal can fly.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b3566155-2b25-4d18-8fdc-653f3c93ac19",
        "syllogism": "Anything that is an animal is a mammal. There are no dogs which are animals. Thus, there are no dogs that are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f11aecef-3e59-473a-b84d-c2cc26525774",
        "syllogism": "Every single person is a human. Anything that is a human is a husband. Consequently, it follows that all husbands are people.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "6f498eff-ed8a-4128-b751-ea02b9d28bc7",
        "syllogism": "Every mammal is made of glass. It is the case that some cats are not made of glass. Therefore, it is true that some cats are not mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ee8e00e2-7bf8-41a3-8009-40d328cb1d60",
        "syllogism": "It is true that no mammals are insects. There are no butterflies that are mammals. Therefore, it follows that some butterflies are insects.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "d20244c4-f1d9-483d-9504-66e3a29118cc",
        "syllogism": "There are no trees that cannot teleport. Every single thing that can teleport has gills. It is a logical consequence that some things with gills are trees.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "941ec598-d637-4f22-b558-367267161a64",
        "syllogism": "Every single planet is a thing made of cheese. The Earth is a planet. A certain part of Earth is made of cheese.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a931aae3-a242-418c-9a4a-4940e4abe241",
        "syllogism": "Not a single pencil is a pen. There are some pencils which are also writing tools. We can conclude from this that some writing tools are not pens.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "65aaed4e-522b-422d-b4e4-cd5dfced222e",
        "syllogism": "Anything that is a mammal is a human. Every dog is a mammal. Not a single dog is a human.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "92c0d24f-2d6f-492e-b5c9-693b39835a52",
        "syllogism": "It is not true that any insect is a bird. All airplains are, without exception, birds. This means that every airplain is an insect.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "963d5e8c-7bbc-4b94-9e38-bba3f6e14854",
        "syllogism": "None of the things that are birds are insects. Every sparrow is a bird. Therefore, it is the case that some sparrows are not insects.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "5042a832-ecad-4b81-a4c8-716ac22397ef",
        "syllogism": "Anything that is a table is furniture. Lamps are not things that are furniture. It's impossible for any lamp to be a table.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "d8c5466a-77d4-47cc-b862-c8df585de57c",
        "syllogism": "Any animal that is a cat is a cloud. Every single animal with fur is a cloud. It follows that no animal with fur is a cat.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "a1bcb9af-88de-40c2-aaf3-55ee03a1ba1b",
        "syllogism": "There are no animals that are also plants. At least one tree is a plant. At least one tree is not an animal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "003f7a6d-6f45-4dd6-8a07-62805dd6d309",
        "syllogism": "Of the people who are children, some of them are humans. A portion of the people who are humans are also children. It must be the case that some children are not humans.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "0403d922-4237-409b-9817-9ea3d0b266c1",
        "syllogism": "It is completely false that any person who is a scientist is an artist. There exists a group of scientists who are also physicists. A valid inference is that some physicists are not artists.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "44d442d7-5ded-41e8-ab37-ba472b6b7594",
        "syllogism": "There are no cars that are bicycles. No bicycles are things that are motorcycles. Therefore, it is the case that some motorcycles are not cars.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "0b331eee-6e74-4e26-a85f-6d5eba71cf31",
        "syllogism": "There are some rocks that are guitars. Every single guitar is a musical instrument. It follows that some musical instruments are rocks.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "11c07653-4008-4b22-aeea-b4b1b4da83ad",
        "syllogism": "There is nothing that is a fruit that is a baked good. Not one passion fruit is a baked good. Consequently, it follows that some passion fruits are not fruits.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8be74042-6920-42ad-8f7f-3c0e53ba5fe7",
        "syllogism": "Plants are never stones. A few stones are, in fact, flowers. There exist flowers that are not plants.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "784d9ce8-5934-4f3f-b89e-96748b1a2758",
        "syllogism": "Every vegetable is a cloud. Any object that is a potato is a vegetable. This means that all potatoes are clouds.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3d7c7fbc-0adb-4101-8aa6-802808fc572f",
        "syllogism": "Every single cat is a four-legged creature. There is no dog that is a cat. It can be concluded that no dog is a four-legged creature.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "1e369b67-1620-4d10-ac81-41690d525f37",
        "syllogism": "Not a single fish is an insect. There are some elephants that are not fish. We can conclude that no elephant is an insect.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "df0aff5c-b274-4b95-9734-fff4407e5a63",
        "syllogism": "Anything that is a square has four equal sides. Every single object that has four equal sides has four sides. This means that all squares have four sides.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "f365e4e6-b827-4b74-b09a-e386043f0e89",
        "syllogism": "It is true that everything that is a dog is an animal. It is also true that no mammals are dogs. Thus, it is concluded that no mammals are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "99c889f6-dd98-4b0d-9fa3-2f6612880fdb",
        "syllogism": "Some aquatic animals can be considered fish. Not a single human is an aquatic animal. As a result, no human is a fish.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8c0b2788-b46e-45b5-bf37-d6226804536d",
        "syllogism": "It is the case that no arachnid has eight legs. Every spider is an arachnid. It follows that no spider has eight legs.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "8b839892-71f7-4ea5-9c5b-7aa33246451f",
        "syllogism": "Every single thing that is a number is a letter. The set of all integers contains no letters. It is the case that there are certain integers which are not numbers.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "7e1a1cc2-c813-4e34-9278-b6ed795138ac",
        "syllogism": "Anything that is a spider is a mammal. All spiders are insects. This means that a few insects are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "9f443de1-8727-4b33-9dcc-20936c3cdb7e",
        "syllogism": "It is not true that any ocean is a continent. Every single thing that is an ocean named Pacific is an ocean. This means some oceans named Pacific are not continents.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "8fad6fdb-f462-4147-9b0f-28b1343200b8",
        "syllogism": "Anything that is a planet is considered a celestial body. It is impossible for a bridge to be a celestial body. Some bridges can be found that are not planets.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "3b9c1d10-9d37-4030-a1e0-7a0734ef18c3",
        "syllogism": "Anything that is a robot is a thing made of water. Every single thing made of water is a planet. From these statements, it can be concluded that some planets are robots.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "dd900a56-5956-4be4-aacd-69f465bf602f",
        "syllogism": "Not a single man is a woman. It is also true that no adult is a man. It follows that no adult is a woman.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "4eec3e1d-089f-4118-bc47-8e1339aee90e",
        "syllogism": "All sedans are cars. Some motorcycles are not cars. Therefore, some motorcycles are not sedans.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "0c04a1b5-b1bc-4e24-bac7-ae6083b0b922",
        "syllogism": "Anything that is a solid is also an animal. There exist some rocks that are not animals. This logically entails that some rocks are not solid.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "1e6eb831-90f8-44bc-9af7-cf906db517a2",
        "syllogism": "Every single shark is an aquatic creature. A number of sharks are classified as fish. Consequently, it is the case that some fish are aquatic creatures.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "f8530683-a0a0-4237-ade3-f1a3db5048d7",
        "syllogism": "Plants are in no way living things. Everything that is a plant is an organism. It's the case that some organisms are not living things.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a0d82c8d-78c5-436b-9365-c243ace27faf",
        "syllogism": "Everything that is a star is cold. A few stars are suns. It is the case that some suns are cold.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3a9614bf-8aa3-4732-9ebd-c766b0d410d6",
        "syllogism": "Every single insect is a creature that has six legs. Anything that is an ant is an insect. Therefore, there are no ants that do not have six legs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "94961071-4c98-4f16-a4a5-a1740f7385ea",
        "syllogism": "All things that are tigers are felines. All things that are cats are felines. It can be deduced that there are cats that are tigers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "95541976-ff89-4549-8a3d-298ceea07086",
        "syllogism": "There exist some felines that are also pets. There are pets which are mammals. The result of this is that some mammals are not felines.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fba06d33-39b6-4e03-ae12-ac3e4f2cb1e0",
        "syllogism": "There are no numbers which are both even and odd. A few numbers that are odd are also divisible by two. Not all numbers that are divisible by two are even.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "17d36cec-c1cf-4ccf-bbac-f9bb5f480a53",
        "syllogism": "Every single poodle is a canine. It is known that no felines are poodles. Consequently, there are no felines which are canines.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "4598dede-6a7f-4cbb-b3fe-b6c05c78c836",
        "syllogism": "Anything that is a doctor is an alien. There are no aliens who are humans. This means that no human is a doctor.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "e7f815bb-c544-4254-ae70-2cce67c91699",
        "syllogism": "Nothing that is clothing is a shirt. There is some apparel that is made of shirts. We must conclude that some apparel is not clothing.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "d1fcc155-1744-4c4b-a040-daf230c6639e",
        "syllogism": "Everything that is a pencil is a writing tool. Anything that is a writing tool is an object. Consequently, we can conclude that that every single object is a pencil.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "494c1ed1-4d99-4018-b050-35170f6165b2",
        "syllogism": "Anything that is a technology is a piece of furniture. No furniture is a phone. It is therefore a sound deduction that some phones is not technology.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "dfb8a20d-5172-4950-98fd-88c8ab747b08",
        "syllogism": "Anything that can be called a musician is also an artist. A portion of artists are painters. A certain portion of painters are not musicians.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "0c25c7bd-6606-4ac2-aa9d-c4da566070f6",
        "syllogism": "No doctor is a lawyer. Lawyers are, without exception, professionals. A number of professionals are doctors.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "b7891f0d-55f4-4f60-9ab2-0f462e15d928",
        "syllogism": "A portion of planets are rocks. There are some moons that are rocks. Consequently, some moons are planets.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "7f808836-92dc-4373-b549-b41528d1a39a",
        "syllogism": "There exist some birds that can fly. A few tables are birds. Consequently, some tables are able to fly.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "43c15f64-aede-463a-89c8-2b4e89583f94",
        "syllogism": "There are some objects that are metals that are not gold. All objects that are metals are elements. Consequently, some elements are not gold.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "b4236af0-41a4-4acf-8f97-493fe6280b37",
        "syllogism": "Anything that is a square is a shape that is round. Every single triangle is a square. This means that all triangles are round.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ece7ce41-fb69-40a6-b3ea-c01d505e35ae",
        "syllogism": "It is a fact that every single dog is a creature. Likewise, it is true that all cats are creatures. Therefore, it has been asserted that every cat is a dog.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "ef765642-a09f-49b2-9336-a2b8bd4bb7c8",
        "syllogism": "Nothing that is a chair is a piece of furniture. A thing that is a table is never a chair. It follows that a table is never a piece of furniture.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "e9e40c9e-9f62-4551-a81c-67160af6292d",
        "syllogism": "It is true that some things that are trees do not have roots. Everything that is a tree is a plant. It logically follows that there are some plants that do not have roots.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "c49471ca-9eb9-463c-a517-fd57b9179d9e",
        "syllogism": "There are no cats that are fish. Every single dolphin is a cat. It is therefore the case that every dolphin is a fish.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d0d4f9ab-2fc8-4786-bbeb-ee04a17448ff",
        "syllogism": "Every politician is a living organism. All senators are living organisms. Consequently, every single senator is a politician.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f9007724-6a5c-48f5-a324-1e95a7a2b660",
        "syllogism": "There is no such thing as a water creature that is able to breathe underwater. Every single fish is a water creature. Consequently, no fish are able to breathe underwater.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "abe7856c-6d01-4804-8925-024dc21d11d9",
        "syllogism": "There are no animals that are living creatures. Every single mammal is a living creature. Consequently, there exist some mammals which are not animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b5a2d8f8-8dc8-4f55-9da3-7b964f045574",
        "syllogism": "No individual who is a physicist is an English teacher. There are some people who are teachers and are also English teachers. Thus, some individuals who are teachers are not physicists.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "6448127c-d151-4443-8c20-b905f2d0146d",
        "syllogism": "Anything that is a mammal is not an insect. It is known that some items that are spiders are insects. A consequence is that some spiders are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d55b879b-3633-419a-8b27-6a4704f0d118",
        "syllogism": "It is true that there are some individuals who are musicians who are not pianists. Every musician is an artist. From these two facts, one can conclude that some artists are not pianists.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "66f1c7d9-8f37-4f93-842e-4020d38b0e68",
        "syllogism": "It is not true that any bird is a cat. No dog is a bird. This leads to the conclusion that no dog is a cat.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "5b7d32a6-8a3c-41a1-ab3f-03143d574cbd",
        "syllogism": "Every human is an animal that is a primate. No animals that are primates are also fish. Therefore, it is the case that some fish are not humans.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "995564e9-24da-47e6-9c8b-c5352eadc638",
        "syllogism": "Anything that is a human is a primate. The set of reptiles contains no primates. Every single reptile is a human.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "51fdf28a-0458-4d35-9d2b-9992fcb0a57e",
        "syllogism": "There is no fire which is hot. All of the bonfires are fire. Thus, there exist some bonfires which are not hot.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a032a04b-1692-4c50-867a-17e2cdfc0387",
        "syllogism": "Every animal is a mammal. There are some reptiles that are animals. It can be concluded that all reptiles are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "2ab78772-0f7f-4554-ab3a-8bd5d40b66e7",
        "syllogism": "Every object that orbits a star is a planet. Anything that is a gas giant is an object that is a planet. Therefore, there are no gas giants that do not orbit a star.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9b4a33d2-4024-4900-9a9f-13f66f1f6b84",
        "syllogism": "Every single hammer is a tool. Nothing that is a wrench is a tool. Therefore, it must be the case that every wrench is a hammer.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c7a40015-f5f1-4a6e-9065-839eadd5172a",
        "syllogism": "There are no politicians that are fish. There are no fish that are lawyers. Therefore, some lawyers are politicians.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "7ba0e12a-e78e-468b-a647-54332b6660b7",
        "syllogism": "Every single mammal is an animal. Every single mammal is a vertebrate. Therefore, there are vertebrates that are animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e977d9ed-ced8-4eee-a678-f1fe41b23b05",
        "syllogism": "Nothing that is a cold-blooded animal is also a reptile. Among the animals that are snakes, some are cold-blooded. It is therefore the case that some snakes are not reptiles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5caaa82f-e106-47af-a5ec-f5a195e341d1",
        "syllogism": "Every creature that is a human is an academic. All professors are academics. This leads to the conclusion that there are some professors who are not humans.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "4480e5d5-495a-4928-a420-a3c74b9268a9",
        "syllogism": "Every single mammal is an animal. Each and every feline is an animal. This makes it true that every feline is a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "eb34cdc4-fa19-4ddc-8cd2-6c8f13f1e7a5",
        "syllogism": "Anything that is a scientist is a person who studies. Anything that is a scientist is a professional. Consequently, some professionals are people who study.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c22180d9-b32d-481d-a2ed-a540c1e1853f",
        "syllogism": "Every keyboard is a cloud. Not a single cloud is a musical instrument. From this, it follows that no musical instruments is a keyboard.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "beb1df32-1d8c-40eb-a481-d08752c30625",
        "syllogism": "The set of living beings is a subset of the set of animals with gills. At least one fish is not an animal with gills. Not every fish is a living being.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "5e28ca3b-7365-4519-aefc-6b8ad8270ff6",
        "syllogism": "There exist creatures which are sharks that are not creatures that leave in water. Every shark is a fish. Consequently, it follows that some fish are not creatures that leave in water.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "73e5dc2c-1c3a-4c0d-96ea-61002d03f225",
        "syllogism": "It is true that all cars are vehicles. Anything that is a bicycle is also a vehicle. It's the case that some bicycles fail to be cars.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "98252dfa-fc4f-4882-b126-5929bce03dad",
        "syllogism": "There is not a single item that is a car and also a truck. A subset of vehicles consists of trucks. It can be deduced that some vehicles are not cars.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "d1a8eb77-d4f7-4b1c-be1a-6e501f5b910e",
        "syllogism": "Every single thing that is a bird is an animal. Anything that is a pigeon is, without exception, a bird. This means that all pigeons are animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "31792188-56c1-4948-89de-1b72940f1e44",
        "syllogism": "Every car is a vehicle. Nothing that is a building can be considered a vehicle. There are some buildings that do not fit the description of a car.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "7047ea6a-0592-4226-9d6c-8d852a4e4d83",
        "syllogism": "Not a single thing that is a canine is a feline. It is the case that a portion of dogs are canines. This proves that some dogs are felines.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "e1d73587-80f8-4605-8498-0ef21fec3ba9",
        "syllogism": "Every single person who is a biologist is a scientist. All people who are physicists are scientists. This leads to the conclusion that all physicists are biologists.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8e73a345-d7c3-4d9f-bd1b-c0b852a03dcf",
        "syllogism": "Not a single person who is a poodle is a dog. Every single animal is a poodle. The conclusion that no animal is a dog is inescapable.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "33d55b15-c886-478b-91bb-8af9b5b7fe31",
        "syllogism": "All successful people are those who can be rich. Every single person who is successful works hard. This proves that everyone who works hard can be rich.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "35ecf751-bb19-4329-ad37-1087d9fe2a0a",
        "syllogism": "Every car is a motorized vehicle. At least one bicycle is not a motorized vehicle. Not all bicycles can be considered cars.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "14973340-3381-49f3-9dcd-3805c7a419bc",
        "syllogism": "It is true that every single book is invisible. Anything that is invisible is also poisonous. This means that a few poisonous things are books.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ffc1a467-4a95-445e-96bf-6064f3348b75",
        "syllogism": "There are no dogs that are cats. There are no dogs that are reptiles. Consequently, no reptiles are cats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "c4526195-4ffd-4b73-b37b-e7fcc91d6812",
        "syllogism": "Nothing that is a liquid is a solid. It is the case that some water is not a solid. The only conclusion is that some water is not a liquid.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6a8f60ed-ac31-45e0-8c05-4915d090f21d",
        "syllogism": "There are no fiction books that are not non-fiction. Anything that is a novel is a fiction book. Therefore, some novels are non-fiction.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a9e0e8bb-07cb-4153-bfc7-cb4428463fc7",
        "syllogism": "Gold is always classified as a metal. Nothing that is a plastic is a metal. Therefore, no plastic is gold.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e9335b28-89be-4bdd-97da-cc84bec3b7dd",
        "syllogism": "A few aquatic animals are fish. All things that are fish are vertebrates. It can be deduced that some vertebrates are aquatic animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "14d879e5-8e7b-41c1-882c-1a75b86844b4",
        "syllogism": "Every single dog is a mammal. Nothing that is a lizard is a mammal. Consequently, there are no creatures that are both lizards and dogs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "28bd236c-0c71-4d83-bf97-b09721850918",
        "syllogism": "No animal that is a dog is a bird. Some of the animals known as beagles are dogs. As a result, some beagles are not birds.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a9d0a8e8-8892-47e4-8b25-85d1bb1394dc",
        "syllogism": "Any beverage that is chilled is cold. Some soft drinks are beverages that are chilled. It follows that some soft drinks are cold.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "942fb93d-8fcc-478a-a1b7-d1bb4610c661",
        "syllogism": "It is the case that some individuals who are professors are not lecturers. Anyone who is a professor is also an academic. Consequently, it can be concluded that some academics are not lecturers.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "8c0b8a2d-6338-4d41-9d69-ca633163341a",
        "syllogism": "The group of furniture is a subset of the group of chairs. At least one sofa is not a chair. Not every sofa is a furntiture.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "ff711f53-e1ce-448e-958b-c702260df860",
        "syllogism": "There are no humans who are insects. A few humans are astronauts. It is the case that a portion of all astronauts are insects.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "59294bfb-c4e7-4b47-8ddf-947ebb9e14ff",
        "syllogism": "Anything that is a fish is not a mammal. There are no dogs that are fish. Consequently, every dog is a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "187905fc-878d-4ac2-bdd6-638daa9818f8",
        "syllogism": "Anything that is a cat is a feline. Every single tiger is a feline. It follows that every tiger is not a cat.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "e213d351-2f05-43b4-b277-c9ecded9473b",
        "syllogism": "Not a single item that is an instrument is a piano. There are keyboards which are also pianos. We must conclude that some keyboards are not instruments.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "17929cfd-f422-400e-a2fe-a28b86424926",
        "syllogism": "Everything that is an oak is a plant. A certain number of oaks are trees. This implies that some trees are plants.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "b46a6c4b-d833-453c-9718-023a87186adc",
        "syllogism": "Anything that is a primate has a thumb. All monkeys are, by definition, primates. We can conclude that some monkeys have a thumb.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "6304f895-d581-4b74-ac78-648b509789f5",
        "syllogism": "There is no plant that is a mushroom. Some of the mushrooms are vegetables. Therefore, some vegetables are not plants.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "4174bbf2-1f54-4ae3-a5e9-cefac102ed46",
        "syllogism": "There are no animals that do not live on land. It is the case that no fish is an animal. At least some fish live on land.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c7fd5116-5c07-4a94-b028-21957275f4b9",
        "syllogism": "There exist some fish that are bony fish. Of the items that are sharks, some are bony fish. We must conclude that some sharks are not fish.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "490459ce-a63c-4b9c-952f-4f2600c080c1",
        "syllogism": "Every single person is a human. A number of women are humans. Consequently, some women are people.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "76d43773-397f-4d6b-8304-d4f2ce89290f",
        "syllogism": "It is the case that no cars are boats. It is also true that no bikes are cars. From these statements, one can conclude that some bikes are not boats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f91a4b0c-fc65-4d9d-9aa6-20e11f95b5a8",
        "syllogism": "Anything with an internal combustion engine needs fuel. Some cars possess an internal combustion engine. From this, it follows that some cars need fuel.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "5b14aaf3-7046-4858-8069-723378b1d76c",
        "syllogism": "All things that are made of wood can catch on fire. There are some chairs that are wooden objects. It follows, then, that some chairs can be set on fire.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a7b103d0-0445-418e-aa2d-7d7302c10c51",
        "syllogism": "It is true that all novels are books. There are some posters that are not books. Therefore, it is the case that some posters are not novels.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "dfd5eb0f-1457-4e71-b1d9-60dd75ce5ebb",
        "syllogism": "It is true that every single vehicle is a cloud. No clouds are cars. Based on this information, it is logically necessary that some cars are not vehicles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ec09b245-cd39-4bf3-95b5-29f73ac156ab",
        "syllogism": "Every single snake is a reptile. It is the case that all lizards are reptiles. It follows that some lizards are snakes.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f82be88d-5ec5-48f2-98ed-84893e692052",
        "syllogism": "Nothing that is a vehicle is a building. All buildings in existence are cars. A certain portion of cars are not vehicles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "17d75025-267a-445c-af3a-f1ad604d6c4d",
        "syllogism": "Everything that is an ocean is a body of water. A few rivers are bodies of water. Consequently, it is possible to infer that some rivers are oceans.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "c9085b40-41d0-45a8-bdcf-306b0fb9ed9a",
        "syllogism": "It is the case that all trees are plants. Anything that is an oak is also a plant. Some oaks fail to be trees.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "45c767ec-4f15-4178-b7cd-91d61f9ffdf8",
        "syllogism": "Each and every star is a celestial body. There are some planets that are stars. Consequently, all planets are celestial bodies.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "975254d3-6a2c-4878-8eb4-4f5bd70a0394",
        "syllogism": "It is not the case that every novel has pages. Every single thing which is a novel is a book. One can therefore conclude that some books do not have pages.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0c88cde4-2b57-4056-8871-e3d64cad89da",
        "syllogism": "Every plant is a living thing. Anything that is an animal is a living thing. It is therefore the case that all animals are plants.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "dbf38723-5390-4452-b85b-19499e555bba",
        "syllogism": "It is true that everything that is an animal is a mammal. It is also true that no reptiles are animals. Thus, it is concluded that no reptiles are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "b601c0d3-7033-4d4a-a8ab-59ac4fe4a4c8",
        "syllogism": "Every object that is a living thing is an object with mass. All humans are objects with mass. Consequently, every single human is a living thing.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fe103879-a542-4b78-b39f-5b3c3969a5a8",
        "syllogism": "A square cannot be a shape. There exist shapes that are squares and are also rectangles. It necessarily follows that a subset of rectangles are not shapes.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "cc4fa2b9-3a5c-449c-b887-703315f129ff",
        "syllogism": "There are some celestial bodies that are stars. There are some planets which are celestial bodies. Planets are in no way stars.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "eb1866e6-0efb-4683-874c-f8303965a818",
        "syllogism": "There are no animals that are vegetables. It is also true that no cats are vegetables. Therefore, it is argued that every cat is an animal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "c38ed5be-cc84-4689-b624-40e8028d6e08",
        "syllogism": "There are no creatures with feathers which are also insects. Every single creature identified as a bird is a creature with feathers. None of the creatures that are birds are also insects.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "6917eb33-a69d-4447-bd79-e891457405d4",
        "syllogism": "There are some mammals that can fly. It is the case that no bird can fly. Therefore, all birds are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "91cc9185-2d04-4140-a98c-61c8b582afe2",
        "syllogism": "Anything which is a human is capable of walking. It is the case that no rock is a human. At least some rocks can walk.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f4db0d1f-081b-4f3d-95a0-726adff675f6",
        "syllogism": "Every single elephant is a mammal. Every single rhinoceros is a mammal. This means that no rhinoceros is an elephant.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "a33f2989-2d8f-40f2-9680-351c1fa406ef",
        "syllogism": "Every single four-sided-shape is a rectangle. All four-sided-shapes are squares. It follows from this that some squares are not rectangles.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f879bc6e-b6df-4283-9c10-51fac98c9f1e",
        "syllogism": "Anything that is a car is an object that moves. Some vehicles are cars. Therefore, every single vehicle is an object that moves.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "55acfad1-cae2-452d-897f-82ff20b9d476",
        "syllogism": "There are no houses that are buildings. There are no cars that are houses. It follows, then, that some cars are buildings.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "ad3f9d03-8ff5-4351-be16-ff960693bd50",
        "syllogism": "Every person who is a professional cook is a person who can cook. A portion of professional cooks are chefs. Thus, it is the case that some chefs are people who can cook.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "0cd88274-2420-4a6f-a7d5-791418d1ac9f",
        "syllogism": "Nothing that is a mineral is a plant. It is known that a portion of rocks are minerals. This leads to the conclusion that a certain number of rocks are plants.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "7e8b844e-cae9-489c-85d2-754e381f6ced",
        "syllogism": "Anyone who is a reader is a scholar. There are students who are readers. Consequently, some students are scholars.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "2219408c-9372-4018-a741-45e971e04512",
        "syllogism": "There is no fish that is a mammal. No mammals are birds whatsoever. This implies that no bird is a fish.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "661f36d9-ec1e-499b-b9ad-1a6ca24dd73a",
        "syllogism": "Hats and jackets do not overlap. A portion of jackets are pieces of clothing. Some pieces of clothing are not hats.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e8e7080d-1e0d-461c-ab4d-5b4718980ffa",
        "syllogism": "The set of refrigerators and the set of pieces of furniture have nothing in common. All items that are sofas are pieces of furniture. Refrigerators are not sofas.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "f2deff13-a6a2-47f0-8835-89a093ad2c5d",
        "syllogism": "Animals and tables have no overlap whatsoever. A portion of tables are birds. Some of the things that are birds are not animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "fe124870-b0cd-4e46-a5f5-67bd5447463a",
        "syllogism": "Some of the mammals are carnivores. Every single carnivore is an animal. It is the case that some animals are mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "ae5332c8-e538-4acc-b93e-e1db2ba41d49",
        "syllogism": "There are no parrots which are mammals. Some birds are parrots. This implies that some birds are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "187124ed-e532-46c1-846e-4e88789f621c",
        "syllogism": "Anything that is a carrot is also a fruit. There is no banana which is a carrot. This means that no banana is a fruit.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "7c03f7df-2432-474c-b889-72c099494fbb",
        "syllogism": "Every spoon is a planet. All planets are singing lessons. It can be logically concluded that some singing lessons are spoons.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "d3bb5775-efda-4bba-b4a7-c546af42cf33",
        "syllogism": "Anything that is an insect is a creature made of glass. Every single ant is an insect. Consequently, all ants are made of glass.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "e364a21e-cecb-4050-818a-20c1195a0f9b",
        "syllogism": "There is not a single item that is both a color and red. Of the items that are hues, a portion of them are red. It must be the case that some hues are not colors.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a0f1b414-9e52-40f6-9b3f-02181b8c8577",
        "syllogism": "Every car can be described as a machine. There are no ferraries that are machines. Consequently, no ferrari is a car.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "1567c398-05f8-425d-8d0f-3fc7c7327cf0",
        "syllogism": "Every single shirt is a piece of clothing. No articles of clothing are ever beverages. This implies that some beverages are not shirts.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "45d94787-3541-406f-af22-4fd535dee8a8",
        "syllogism": "Every vehicle has wheels. At least one car does not have wheels. Not all cars are vehicles.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6cb41e5e-32e3-4eeb-b3b2-700c7e3a692f",
        "syllogism": "Anything that is a dog is an animal. Everything that is a cat is an animal. It is the case that some cats are not canines.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "3a99d768-f046-4aff-a9fd-78b6abed373a",
        "syllogism": "There is no plant that is a rock. Some of the rocks are flowers. Therefore, some flowers are not plants.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "4afebaca-60c2-4a9e-aa14-81508d9f6a0c",
        "syllogism": "People are not, in any way, learners. Anything that is a student is a learner. Students cannot be people.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "982c7ee4-d97d-4ff7-927b-351beb3c89e9",
        "syllogism": "All things which are oceans are computers. All things which are oceans are made of silk. It follows that some things made of silk are computers.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3be34539-8d21-4398-a341-054fc05f0e60",
        "syllogism": "Nothing that is mortal is immortal. Every single human being is a mortal creature. Therefore, no human is immortal.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "312d903d-c5fc-4ac8-beb2-3ec72f6b25b9",
        "syllogism": "There are no plants that are fish. Some objects classified as a rose is a plant. Therefore, no roses are fish.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "619eeec3-c9e1-404d-8ca6-5375df3777bb",
        "syllogism": "Furniture are things that are in no way items for sitting. All items that are chairs were designed for sitting. Chairs are not furniture.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "555e904c-ecda-4b8b-8e97-d80dafe29a87",
        "syllogism": "Every monkey is a primate. There are some animals that have prehensile tails which are monkeys. This means that a few animals with prehensile tails are primates.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "0700415b-1bd2-4bf2-baba-848f70b38c7d",
        "syllogism": "Some trains are not celestial bodies. It is the case that every single train is a planet. Consequently, some planets cannot be considered celestial bodies.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5797d6f3-0f12-4f1f-90ae-6d1c5098dc5c",
        "syllogism": "Every single truck is a vehicle. There are some scooters which are not vehicles. It follows that some scooters are not trucks.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "715d4b07-8fea-458e-9a03-b127a0a18ea5",
        "syllogism": "There isn't a single car that is a two-wheeled vehicle. Everything that is a bicycle is a two-wheeled vehicle. This proves that some bicycles are not cars.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "42f67665-07b1-4466-b825-8ec4367d126e",
        "syllogism": "There are no items that are not plants that are plants. A number of items that are not plants are trees. Therefore, a portion of trees are plants.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "3302e35f-aa7e-421a-8724-7186ac4bf418",
        "syllogism": "There's no small rodent that is a bear. Every single squirrel is a small rodent. Consequently, no squirrel is a bear.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "731d69cf-0a9f-4ba4-b7b2-061858bb0c03",
        "syllogism": "There exist no poodles that are also cats. Every single creature that is a poodle is a dog. It follows that not a single dog is a cat.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f5a5b2ca-22cf-4dc4-bfef-43b39b6c641c",
        "syllogism": "Any individual who is a teacher is a robot. There are some educators who are teachers. Consequently, some educators are robots.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "745662c5-c85b-4940-83fe-cea6bd5be051",
        "syllogism": "Anything that is a human is a primate. Every single whale is a mammal. Not a single whale is a human.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "8e7c3181-8819-4648-a6f9-33b1009c59c3",
        "syllogism": "Everything that is a tree is a plant. Not a single stone is a plant. All stones are trees.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "166f5a4c-b0e7-4f2b-b25d-1c0a08bd59bb",
        "syllogism": "Every single human being is a mammal. It is also true that every lion is a mammal. This means that there are no lions that are humans.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "1856a3b0-cc1d-49ac-86ec-c6c313dd09e8",
        "syllogism": "Some animals are human. There are politicians who are human. This means that some politicians are animals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ff719160-ec4d-47a3-9621-a2d1dbb6115c",
        "syllogism": "There are no mammals that are birds. Every single dog is a mammal. It is therefore the case that every dog is a bird.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "ed7937f5-a98e-4385-a58a-0d24b4f23651",
        "syllogism": "Anything that is a cat is a feline. It is true that all felines are carnivores. This means that a few carnivores are cats.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1abfb720-5619-4658-a940-990150c82d3b",
        "syllogism": "Every single human is a monkey. There are no primates that are monkeys. From this, it follows that no primate is a human.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f2dd94c2-9171-442a-92c2-fdc929df2593",
        "syllogism": "Every single building is alive. There is not a single living thing that is a house. This means that no house is a building.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0d500642-6df5-486f-ba53-d5ccdd5a3061",
        "syllogism": "Every single writing tool is a spaceship. There are some erasers which are not spaceships. It follows that some erasers are not writing tools.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "4c8d8de7-6547-4766-8f98-7f28dd8b4b9a",
        "syllogism": "There are some individuals who find pleasure in reading who are librarians. Every single person who is a librarian is a student. It is the case that some of the people who are students are people who enjoy reading.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "68b29c80-27f6-4121-8408-295bd8de466c",
        "syllogism": "Anything that is a bird is a vertebrate. It is also the case that every single bat is a vertebrate. Consequently, nothing that is a bat is a bird.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "acd76fff-dd32-4375-9c2e-21909ea1bcf1",
        "syllogism": "Absolutely nothing that is a reptile is a mammal. Among the creatures that are animals, some are mammals. Consequently, some of the creatures that are animals are not reptiles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "02f9e80f-e3ec-49b8-99e8-a0153091e603",
        "syllogism": "Nothing that is an animal is a non-living thing. There are some mammals that are not non-living things. It follows that some mammals are not animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "1600dc48-793c-41d2-a799-317b09a81c7e",
        "syllogism": "Every single integer is divisible by two. All integers are even numbers. It follows from this that some even numbers are not divisible by two.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "0872ecdb-a56f-421d-8f30-e3be4d70c054",
        "syllogism": "There are no liquids that are solids. Some of the things that are beverages are liquids. It follows that some beverages are solids.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f41764ae-c58b-448c-a721-5d72c5120697",
        "syllogism": "Nothing that is a cat is a reptile. A creature that is a reptile is never a mammal. It follows that a cat is never a mammal.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "76f9b327-1308-4678-af38-44f61eafb137",
        "syllogism": "There are no birds which are cats. There are no dogs that are birds. It follows, then, that some dogs are cats.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "a6fde999-62a6-4246-9901-654ac4901490",
        "syllogism": "Every capital city is considered a major city. A portion of capital cities are located in Europe. It therefore follows that some cities in Europe are major cities.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "7bddb337-7964-4154-8a1e-e61e910b2b7f",
        "syllogism": "Some of the spoons are reptiles. All things that are reptiles are vertebrates. Consequently, it can be concluded that some vertebrates are spoons.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b0164134-d52b-4506-92ee-d71e2109d717",
        "syllogism": "Every single thing that is a snake is a cold-blooded animal. A few snakes are a type of reptile. Thus, some reptiles are cold-blooded animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "d225ab47-ffe9-454b-bb41-4915c4214497",
        "syllogism": "Anything that is a fish swims. It is the case that no dog is a fish. This implies that some dogs swim.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "4780354b-3991-4ce8-9981-23d4f3030141",
        "syllogism": "There are no stones that are alive. There are no trees that are stones. Therefore, no trees are alive.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "02e208cf-8240-466b-8460-d73f4c35c354",
        "syllogism": "Every single writing tool is a pencil. No pen is a pencil. This means no pen is a writing tool.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "96d7a4e1-391c-4286-a7ca-7fbf1576366e",
        "syllogism": "There exist some mammals that have fur. There are some reptiles which have fur. Consequently, a number of reptiles are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "2e96d73d-cbad-4b86-b8d5-f02334bed473",
        "syllogism": "Among the items that are dogs, some are mammals. There are pets which are mammals. We must conclude that some pets are not dogs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "6fc2d9ce-e18c-4433-97c7-9eef45031a43",
        "syllogism": "All plants are in need of sunlight. All trees are, by definition, plants. At least one tree needs sunlight.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "496112d9-7a6c-4572-9956-21b646a5d0d7",
        "syllogism": "Not one single insect is a six-legged arthropod. Every single item that is a bug is a six-legged arthropod. It follows from this that a portion of bugs are not insects.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3a245c0d-ffb8-4700-a248-70a1917ab838",
        "syllogism": "There exist cats that are also mammals. A subset of dogs can be classified as mammals. It follows that at least some dogs are not cats.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "c3ed1a57-88e6-4451-8592-de1be8c8066d",
        "syllogism": "There are no birds that do not have wings. It is the case that no insect is a bird. It follows that some insects have wings.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "e125f054-b5b7-4eba-b1a9-b942cbe8f552",
        "syllogism": "It is not the case that every single vegetable is a food. All vegetables are pizzas. Thus, some pizzas are not foods.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "2f97c41c-4b5a-407a-a57c-95fa1ea134f6",
        "syllogism": "Not one single rectangle is a four-sided polygon. Everything that is a square is a four-sided polygon. The implication is that a portion of squares are not rectangles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "06d7f64b-e471-4c35-a81f-0217f4a84435",
        "syllogism": "It is true that everything that is a table is furniture. It is also true that all furniture are objects. Thus, it is concluded that all objects are tables.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "8bf12840-1728-41eb-a389-01098b625ecf",
        "syllogism": "Among those who are students, there are some who are athletes. Every single student is a person who spends time studying. It follows that, of the people who study, some of them are also athletes.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "830b0cc9-935e-45ba-ab5c-1deb894fa119",
        "syllogism": "It is a fact that all mammals are animals. There are some animals which are cats. Therefore, every single cat is an animal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "c72ea95e-851f-4e43-af9d-17d7ecc26a0d",
        "syllogism": "Wives are not people. Anything that is a wife is a husband. It's the case that some husbands are not people.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "f261b7cf-efcb-403d-ac2c-c5cebddab402",
        "syllogism": "There is no physicist who is not a person. It is true that all physicists are scientists. It follows that some scientists are people.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "93a88d43-069b-4339-85b5-84b9ae226f88",
        "syllogism": "Every teacher is a robot. None of the robots are humans. It follows that no human is a teacher.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3576315f-5476-4468-8a99-94e2afb295f1",
        "syllogism": "Anything that is a spoon is a form of cutlery. No cutlery items are books. This logically entails that some books are not spoons.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "fdfe04da-1f41-4062-9295-cc599cfae310",
        "syllogism": "Everything that is a song is also a mountain. Everything that is a song is also made of water. Hence, some things made of water are mountains.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "094f320d-ea3a-4e4e-be55-d09692332089",
        "syllogism": "It is a fact that every tulip is a flower. It is also true that all roses are flowers. Therefore, it is concluded that a few flowers are roses.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "864fb4b2-8a19-4767-83f4-1dbed28f27e7",
        "syllogism": "Some of the dogs are mammals. Every mammal is a domesticated animal. From this, it can be concluded that some domesticated animals are dogs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "1da871da-0cd9-4734-855e-3c6b5fd057d3",
        "syllogism": "Everything that is a doctor is a medical professional. Anything that is a medical professional is a human. Thus, every single human is a doctor.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d58fd355-2a98-4501-ac04-058a05090a80",
        "syllogism": "Anyone who is a president is a citizen. Every single person who is a senator is a citizen. This leads to the conclusion that there are some senators who are not citizens.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d32207a5-ea82-4d7d-9a51-48f1b384dd8f",
        "syllogism": "There is not a single sound that is a phenomenon that travels in waves. All of the things that are musical notes are sounds. Consequently, some musical notes are not phenomena that travel in waves.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a0b75805-fa2b-44f3-b9f5-b08dcb9b0033",
        "syllogism": "It is not the case that a paper good is made of paper. Each and every book is a paper good. It logically follows that no books are made of paper.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0f476f71-6f8c-4780-8ce3-1f00300227e1",
        "syllogism": "Every piece of furniture that is a chair is made of liquid. Any object that is a bench is a chair. Consequently, all benches are pieces of furniture that are made of liquid.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "81d80343-1088-400b-be29-0d63312a959b",
        "syllogism": "All things which are mammals are vertebrates. A portion of warm-blooded animals are mammals. Therefore, there exist some warm-blooded animals that are vertebrates.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "bdce56a3-a9d8-476a-a050-d6c653a79061",
        "syllogism": "Not a single house is a stadium. Every single stadium is a building. It is therefore the case that some buildings are not houses.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "e31bb89a-6c5b-4745-8952-8ee9c2649776",
        "syllogism": "The class of insects and the class of lions do not overlap. Every single lion is an animal. As a result, some animals are not insects.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "3385a56c-c169-4cea-ab4b-5a48ed4980d1",
        "syllogism": "There exist some birds that are fish. A number of sharks are fish. It follows, then, that some sharks are birds.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "ec60f858-72d6-455b-976f-fe289c371eaf",
        "syllogism": "Every dog is a mammal. No dog is a reptile. Therefore, no reptiles are mammals.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "6a44409a-3040-47b0-8f76-a2eb6d8c27ab",
        "syllogism": "It is the case that all professionals are adults. Some people are not professionals. Therefore, it is implied that some people are not adults.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "68affb76-c5fc-4423-9221-1784c4509086",
        "syllogism": "Every novel is a book. Nothing that is a magazine is a book. Therefore, a magazine cannot be a novel.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "6e672b31-84e2-4b83-92ca-30f90e27bd00",
        "syllogism": "There are no mammals that are fish. Among the fish, a few are canines. Not all canines are mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5029f069-0076-49ad-b65e-b592fed18083",
        "syllogism": "There are no dogs that are reptiles. Everything that is a fish is a dog. Thus, every fish is a reptile.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "31cd942c-7484-4e2a-8552-902391d50530",
        "syllogism": "It is impossible for furniture to be a chair. A portion of chairs are tables. Some of the tables are not furniture.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b93c1c6a-958a-4cfb-975b-585432f3cd20",
        "syllogism": "Kitchen items are never hammers. A few hammers are, in fact, tools. There exist tools that are not kitchen items.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "06a0aa7f-5aaa-4a9a-af0e-7cfc8affd23a",
        "syllogism": "Everything that is a bird is an animal. Every single eagle is an animal. It is the case that some eagles are birds.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "e34fafec-30b9-4a28-a470-eb952d244988",
        "syllogism": "Anything that is a planet is a celestial body. Not a single Earth is a celestial body. It follows from this that no Earth is a planet.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a7d18367-6870-4eee-9a55-60a5dcc9dd70",
        "syllogism": "Anything that is a dog is also a pet. There are some cats that are not pets. It must be true that no cat is a dog.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "0facfad6-abe4-4a37-bd8a-5996bd3a2254",
        "syllogism": "Anything that is a fish is an animal. There are birds, and all of them are animals. Based on this, it must be the case that every bird is a fish.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "7c5ab39b-14be-4b8f-aea0-58f360ec1c58",
        "syllogism": "It is the case that no bird is a fish. It is also not the case that any fish is a mammal. It follows from this that no mammals are birds.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "69b3cfc6-9b74-4553-a6b6-6fbed67e9eba",
        "syllogism": "There are no animals that fly which are also fish. Every creature that is a bird is also a flying animal. As a consequence, there is not a single bird that is a fish.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "3ecdc552-39d1-4b9b-8255-dda2990d7197",
        "syllogism": "There are no cars which are airplanes. Some of the things that are vehicles are cars. It must be true that some airplanes are not vehicles.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "5cc44de7-9c1c-45d1-b8e7-7711e1bafce3",
        "syllogism": "Every parrot has a beak. All parrots are classified as birds. Therefore, it must be that all birds have beaks.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "b1817bad-3418-463a-8bef-82d34ee31dfd",
        "syllogism": "A thing that is a square cannot be a circle. There exist shapes that are squares and are also polygons. From this, we know for certain that some polygons are not circles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "08408587-3887-4246-9d6f-7a4492ad48c7",
        "syllogism": "Anyone who is a rose is red. Some flowers are not red. From this, all flowers are roses.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "89694013-2061-4e74-b907-514d57cc67b2",
        "syllogism": "A portion of healthy foods are vegetables. There are some carrots that are vegetables. It follows, then, that some carrots are healthy foods.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "4823d0a9-5eae-4386-af0f-54d04c9cd2cf",
        "syllogism": "Anyone who is a doctor is trained in medicine. Every single pediatrician is a doctor. It is the case that some pediatricians are trained in medicine.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "4157f15c-b21e-4946-84cb-19be0df5f51f",
        "syllogism": "Every flying object is a creature with wings. Any and all elephants are also creatures with wings. This implies that all elephants are flying objects.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "9117126d-5160-40c0-81c1-3f784d8f8cef",
        "syllogism": "Everything that is a fish is a vertebrate. A portion of vertebrates are sharks. A subset of sharks are fish.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d1c9c4bb-2e00-41ae-909c-425ff182f92c",
        "syllogism": "Stars and gas giants have no overlap whatsoever. At least one thing that is a gas giant is a planet. Some of the things that are planets are not stars.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "f2a9e4e1-a969-436f-877c-bb605fb7c62e",
        "syllogism": "It is not the case that every huma is a man. Every single man is a human. From this, it follows that some humans are living beings.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "428fcd4d-5c1a-4c6b-b836-a6cf49562c77",
        "syllogism": "Anything that is a doctor is also a human. No humans are ever insects. This logically suggests that some insects are not doctors.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "199ec342-0add-469d-87ce-5c375b2f75d1",
        "syllogism": "Every single liquid is a molecule. Every single gas is a molecule. As a result, all gases are liquids.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d8954215-16e1-4b1a-ab2f-bb98b633712d",
        "syllogism": "There are some ideas that are made of cheese. Every single idea is an emotion. Consequently, some emotions are made of cheese.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "88906e17-b2f0-4ba9-9a42-387949ef58d8",
        "syllogism": "There is no such thing as an insect that is also a mammal. Every single ant is an insect. It logically follows that ants are not mammals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "57cefbea-6a5e-4b24-b537-007d1837b288",
        "syllogism": "A few large predators are insects. Every single insect is a tiny creature. It logically follows that some tiny creatures are large predators.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "cc362ec8-4aca-4868-acb7-c4b193c9dd20",
        "syllogism": "There are no chairs that are not furniture. All furniture are items found in a household. It follows that some items found in a household are chairs.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "7fc2053a-6dba-4035-89ca-1cc3397c9e15",
        "syllogism": "Polygons and circles have no overlap whatsoever. At least one thing that is a circle is a triangle. Some of the things that are triangles are not polygons.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3b1c7731-50f6-4d9b-a0a1-9d9afa9134e3",
        "syllogism": "Everything that can be classified as an apple is a vegetable. Everything that is a carrot is also a vegetable. Every single apple is a carrot.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "fd7d1283-6217-4458-8f48-40968017069c",
        "syllogism": "Every single vehicle is an animal. No cars are animals. A portion of modes of transportation are not vehicles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "342ddbb4-d0f4-41d5-9fe8-b9cfa5414ee9",
        "syllogism": "Every single human is an alien. Every single human is a reptile. Therefore, there are reptiles that are aliens.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "89cbc28f-fbfa-46fd-849a-14aaaf90eece",
        "syllogism": "There is no book that is an electronic device. All electronic devices are items. This proves that some items are books.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f98919ca-cc46-4be8-b485-2a8085bb3303",
        "syllogism": "There are some robots that are teenagers. Every teenager is a human. It follows from this that every single human is a robot.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "e630eecd-f2e5-40b2-8417-3d88982377a5",
        "syllogism": "None of the items that are carrots are bell peppers. There are vegetables that are bell peppers. It is correct to infer that some vegetables are not carrots.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "4a57a2e2-b86d-45ec-9db2-f15de898af11",
        "syllogism": "No animal that is a reptile is a mammal. A few of the things that are fish are reptiles. This leads to the conclusion that a certain number of fish are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "bac14978-b426-42f3-830e-d222127e8425",
        "syllogism": "No relatives are considered family members. Everything that is a sibling is a family member. It can be deduced that a part of siblings are not relatives.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b849ab87-08a8-4ad7-9535-633e79d73ca5",
        "syllogism": "A celestial body is never a piece of furniture. Each of the planets is, in fact, a celestial body. For this reason, no planet is an item of furniture.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "a3192ff9-b4bd-45f0-a28b-29874369e42a",
        "syllogism": "Any person who is a man is a human. Every man is a bachelor. It follows that every bachelor is a human.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "f7420d57-87e1-4e25-9dfd-9a2154f044ba",
        "syllogism": "Some fruits are bicycles. Every bicycle is a vehicle. Therefore, some vehicles are fruits.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "0a60216c-0892-42a4-9afb-f72f70ce24b9",
        "syllogism": "A portion of fitness enthusiasts are runners. Anyone who is a runner is also an athlete. Therefore, a subset of athletes are fitness enthusiasts.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9fcdef6b-4601-4603-92bc-1124b386ce5b",
        "syllogism": "Anything that is a rose is a plant. There are no animals that are roses. Consequently, there are no animals that are plants.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "e8b5e46d-d26f-4c48-bba0-4a109e59574f",
        "syllogism": "Anything which is a dog is a living creature. It is the case that some living creatures are not mammals. Therefore, it follows that some mammals are not dogs.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "1645c4b0-8647-41e2-be04-11e6354dbd90",
        "syllogism": "Every single animal is capable of breathing underwater. There are no horses that are not animals. A number of horses are able to breathe underwater.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "fe6dd099-e8d5-4076-b047-91eaafd96b26",
        "syllogism": "It is completely false that people who are students are inhanimate objects. There exists a group of students who are also teenagers. A valid inference is that no teenagers are inhanimate objects.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "dfc65c12-102b-4777-9479-e942e4f0449b",
        "syllogism": "Anything that is a reptile is also an animal. A portion of the animals are snakes. Thus, not all snakes are reptiles.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "dae7557a-fcc6-473b-892f-211012df55af",
        "syllogism": "Not a single mammal is an object that can think. The entire group of objects that can think is a subset of people. It is a logical consequence that some people are not mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "cd8078e7-ae64-45ec-bd51-3c3b06dcd739",
        "syllogism": "Every single car is an emotion. Every single car is a musical instrument. Therefore, there are musical instruments that are emotions.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "da6c1393-f23f-4eac-aae5-0bafb07f6839",
        "syllogism": "Every work of poetry is a type of literature. No sculpture is literature. It is the case that no sculpture is poetry.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "65d32413-e8d9-49f8-a457-bda26a3a483a",
        "syllogism": "Every single arachnid has six legs. There are some spiders that are arachnids. This means that there exist spiders that have six legs.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "055f965a-33f5-4607-9c66-4aa40bec3f17",
        "syllogism": "Anything that is a rose is a flower. Under no circumstances is a flower a tree. This leads to the conclusion that some trees are not roses.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "39ef54c3-ec74-44c7-88ae-308fb8f33f9c",
        "syllogism": "Nothing that is a mammal has feathers. A portion of the things that are birds have feathers. It must be the case that every single bird is not a mammal.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "3ebaf437-de7a-4dfa-9dc7-95b0cda7f532",
        "syllogism": "Anything that is a car is a vehicle. There are some Toyotas that are cars. This leads to the conclusion that some Toyotas are vehicles.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "ca77844f-fa81-48ad-9013-ac9ab5be20e0",
        "syllogism": "It is the case that no flying animal is a penguin. Anything that is a penguin is also a bird. It necessarily follows that certain birds are not flying animals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "eff43e93-d2d9-4b07-877e-d63a8bdf260d",
        "syllogism": "Every poodle is a dog. No cat is a poodle. Therefore, no cat is a dog.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "84bd592a-b425-4b83-a3f1-7ea71c85910e",
        "syllogism": "Flowers are in no way organisms. Anything that is a flower is a plant. It's the case that some plants are not organisms.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "99b78ff8-443d-4c05-86a9-b7bf99330fdd",
        "syllogism": "Any person who is an author is a creative. There are no tables that are authors. Consequently, no table is a creative.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "857910a3-46a9-4278-9d37-739de49debd6",
        "syllogism": "There are no humans that are not made of glass. Every single thing made of glass is indestructible. From this, it can be derived that some indestructible things are humans.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "49eaeadb-ba70-4eca-be9a-3aaa24144cee",
        "syllogism": "It is not true that any vehicle is a bicycle. There are a few bicycles that are also automobiles. There are some automobiles that are not vehicles.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "042f9653-500e-408f-a1e5-e9ea64c7bf96",
        "syllogism": "Every fish is an animal. Anything that is an animal is a mammal. It follows that every mammal is a fish.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "26349422-9759-46d4-95fe-47058f4ee109",
        "syllogism": "Anything that is a cat is an animal. It is not true that any fish are cats. It follows that no fish are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "a3b7dea6-fa56-4175-ae3d-e4765d415033",
        "syllogism": "The category of animals and the category of plants do not overlap. Every single plant is a mammal. It must be that a portion of mammals are not animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ede020f2-2276-4afd-a95d-912b5064d0b2",
        "syllogism": "It is the case that no creature that is a mammal is a fish. There exists at least one creature that is a mammal and also a dolphin. This proves that at least one dolphin is not a fish.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "c645579b-f3ec-4448-b51d-6ac03b047bd0",
        "syllogism": "There are no doctors who are not medical professionals. There are no doctors who are not people with medical degrees. Therefore, some people with medical degrees are medical professionals.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "da09f353-9c5e-46fb-a804-3be6a4cf003e",
        "syllogism": "It is true that some lawyers are mythical creatures. Anything that is a lawyer is a politician. As a result, some politicians are mythical creatures.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "a705b3cb-369e-44bf-bba4-dadf794fef77",
        "syllogism": "The set of people and the set of individuals who hold public office are mutually exclusive. Every single person who is a politician is an individual who holds public office. Politicians are not people.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5891fe9d-5de9-48e2-b484-98d70a27a2d4",
        "syllogism": "No teachers are students. No students are professionals. It necessarily follows that some professionals are not teachers.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "1d435e7a-87e9-48a6-b87b-2cf3df3b1b1f",
        "syllogism": "Everything that is a vehicle is a magical item. A portion of vehicles are cars. It necessarily follows that some cars are magical items.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "1f010b69-61c4-4d5b-8cca-ea37c60a9bf6",
        "syllogism": "There are no liquids that are not solid. Anything that is water is a liquid. At least one quantity of water is solid.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "dcd52b2a-0ff8-4826-a5e1-710238698ef7",
        "syllogism": "Anything that is a parrot is a bird. Every single bird is an animal. One must conclude that every animal is a parrot.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "ddbd0598-37ce-41d2-89c6-73109dcf196c",
        "syllogism": "Everything that is a salamander is a planet. A few salamanders are amphibians. It must follow that a certain number of amphibians are planets.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "34a587b6-0296-4a94-92a1-664fafcf8109",
        "syllogism": "A group of animals are vertebrates. It is a fact that some animals are not insects. It is necessarily true that no insects are vertebrates.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "42e1d763-31f6-4725-a17f-6fdcb0088fde",
        "syllogism": "Every item that is a shirt is an article of clothing. Every single t-shirt is a type of shirt. Consequently, every t-shirt is clothing.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "4aa7d765-8418-4e15-8bdb-60c1ac852e08",
        "syllogism": "Anything that is a tomato is also a planet. There is no planet that is a food. It is thus the case that no food is a tomato.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "ce270103-67cc-4d82-a87e-901a04837037",
        "syllogism": "Humans are in no way animals. Anything that is a human is a mammal. There are some mammals which are not animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "fa20c4cd-223e-41f9-a5f7-4634a35cd279",
        "syllogism": "There are no instances where flowers can be considered trees. Every single tree is a type of plant. It must be the case that some plants are not flowers.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "9e8d8063-b183-4026-85a2-592f021e292b",
        "syllogism": "It is true that no birds are insects. There are some people who are not insects. Therefore, we can conclude that some people are not birds.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "fd526302-739f-45f2-95ed-73c2b00a85cb",
        "syllogism": "Every dog is a mammal. Anything that is a cat is a mammal. This means that every cat is a dog.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "21dd3f2c-d1a1-409f-9307-3f8a54ab5417",
        "syllogism": "There is no worm that is an insect. Every worm is a bird. This leads to the conclusion that all birds are insects.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "f604bd06-9e07-46d3-8554-16cc2b4fbb33",
        "syllogism": "Everything that is a dog is an animal. Everything that is a cat is an animal. All felines are canines.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "60d3843b-0fde-4c47-8663-aed5930df07f",
        "syllogism": "Every single bird is not a mammal. A portion of the things that are pets are not mammals. It must be the case that some pets are birds.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "a3fc4115-5212-451a-888d-d044c14c1678",
        "syllogism": "Any creature that is a cat is not an animal. There are cats which are also dogs. From this, we know that there are certain dogs that are not animals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "3e50a21d-a81c-4c71-82b5-4c5a94dcd47c",
        "syllogism": "It is not true that any car is a train. There are a few trains that are also types of transportation. There are some types of transportation that are not cars.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "ae840f15-62f1-4001-9db4-28c53d3ee8d9",
        "syllogism": "No animals that are mammals can be considered fish. It is the case that some whales belong to the category of mammals. Consequently, some whales are not fish.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "d6df77ba-b9bf-45e1-8e5b-c73c5ca30f46",
        "syllogism": "A triangle is never a square. It is also the case that no circle is a square. Consequently, no circle is a triangle.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "4bd9a4a6-1764-45fc-8172-86c65200f855",
        "syllogism": "Not a single thing that is a reptile is a mammal. Among the items that are reptiles, some are snakes. This proves that a number of snakes are mammals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "5f8e74b8-1b0c-4ecd-aafc-80e050524be1",
        "syllogism": "The group of birds and the group of mammals do not overlap. Anything that is a mammal is an insect. It is the case that some insects are birds.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "9ee02b68-eddc-44c9-855a-103d63c9b241",
        "syllogism": "Every single feline is a cat. Every single mammal is a cat. Therefore, there are mammals that are felines.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "059182d4-4b95-4caa-9895-b79368d8c736",
        "syllogism": "A number of chairs are people. Anything that is a person is an organism. Therefore, a portion of organisms are chairs.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "c185453e-1e55-4186-a79b-4adf21c75a83",
        "syllogism": "Every single car has wheels. Every single bicycle has wheels. It follows that all bicycles are cars.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "d93e9241-f9bc-43f7-b482-b395b21e086b",
        "syllogism": "It is true that no birds are fish. It is also true that no fish are plants. Therefore, no plants are birds.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "0392a395-81cd-404c-bb1e-e16c0180b9d8",
        "syllogism": "Every single apple is a fruit. There are no fruits which are vegetables. This necessitates the conclusion that no vegetable is an apple.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "69678d2f-3489-4408-9179-f342e58e4fc1",
        "syllogism": "Every car is a vehicle. At least one motorized vehicle is not a vehicle. There is at least one motorized vehicle that is not a car.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "0c41f657-b5c7-49f0-ba40-93192828326c",
        "syllogism": "Every single bird is a mammal. It is the case that no lion is a bird. It is the case that no lion is a mammal.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "e4494df1-2233-4972-bb0c-0df36d3a45d9",
        "syllogism": "Every single rose is a plant. It is true that all flowers are plants. From this, it is stated that some flowers are roses.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "29f55c62-ba5d-437a-b1f6-0fe84b021678",
        "syllogism": "Some of the sports that are for teams are sports. Every single thing considered a sport is a recreational activity. Therefore, some recreational activities are team sports.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "ceded7c3-ea95-4f1f-8706-8797294b5a4a",
        "syllogism": "There is no ice that is frozen water. All things that are glaciers are ice. It follows that some glaciers are not frozen water.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "6174dafb-949c-4bfa-8056-f3ba35a3a47f",
        "syllogism": "Nothing that is a liquid is H2O. All water is H2O. It can be deduced that some water is not liquid.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "b0448c8e-5688-4643-bc13-9379ddc605cd",
        "syllogism": "There are no animals that are rocks. It is also true that no dogs are rocks. Therefore, it is argued that there are no dogs which are animals.",
        "validity": false,
        "plausibility": false
    },
    {
        "id": "6df0ab4c-8518-4efb-98d5-e1bd172b5a35",
        "syllogism": "Some creatures that can fly are birds. It is true that some sparrows are flying creatures. For this reason, every single sparrow is a bird.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "0db674a5-4391-43fd-8d40-b6ec2b6e77e3",
        "syllogism": "Every single thing that is a hammer is a tool. All screwdrivers are also tools. It must be true that no screwdriver is a hammer.",
        "validity": false,
        "plausibility": true
    },
    {
        "id": "6650eef5-2045-4ee2-8fe1-a3036d54c6b6",
        "syllogism": "No person who is a doctor is also a teacher. Anything that is a teacher is a profession. Therefore, some professions are not doctors.",
        "validity": true,
        "plausibility": true
    },
    {
        "id": "452c2309-abd1-4cd9-9cd9-1e693ef85cf6",
        "syllogism": "A creature that is a reptile is never a mammal. There is a group of reptiles that are also elephants. It must logically follow that some elephants are not mammals.",
        "validity": true,
        "plausibility": false
    },
    {
        "id": "5bb97f94-d046-4219-9893-3b1bc4778d0b",
        "syllogism": "Everything that is a tree is a plant. Not a single human is a plant. All humans are trees.",
        "validity": false,
        "plausibility": false
    }
]